{"query":{"count":2,"created":"2016-07-05T13:15:01Z","lang":"en-US","results":{"results":[{"item":[{"title":"Wanted: Video game programmers (UI and VFX) familiar with Unity (Basically anywhere.)","description":"Any programmers out there familiar with Unity interested in working on a 2½D (2D gameplay, 3D graphics — think <em>Street Fighter IV</em>) fighting game being made by an independent publisher? Gameplay is already fairly well into development, but the creators are looking to add another programmer or two who are familiar with Unity to work mainly on UI implementation (menus, player records, netplay, etc.) and in-game visual effects. Both are contractor-into-full-time positions. Please send a cover letter to jobs@sirlingames.com along with résumé, portfolio, etc.","link":"http://jobs.metafilter.com/mefi/1599","pubDate":"Sun, 10 Apr 2016 19:21:01 -0800"},{"title":"Research Assistant who is also a boardgame fan (From anywhere)","description":"I am a professor at a business school, and working on a project involving innovation. In one part of the project, I am examining the sources of inspiration behind crowdfunded boardgames.  I have a list of the games that inspired each crowdfunding project, and I need help matching those to the list of all games on BoardGameGeek.  I would also want to track down those crowdfunded games that launched so I can see how well they were reviewed.<br />\n<br />\nIdeally, the list (probably 350 or so games, each with 2-3 inspirations) would be completed in the next couple of weeks.  I'll provide more instructions and spreadsheets, etc.  Ideally, you are a boardgame fan who would recognize many of the games on the list, which will make matching easier.<br />\n<br />\nSend me a memail if interested. ","link":"http://jobs.metafilter.com/mefi/1596","pubDate":"Fri, 08 Apr 2016 20:52:14 -0800"}]},{"item":[{"title":"Modern Tribe Inc: Designer","link":"http://authenticjobs.com/jobs/27601","pubDate":"Mon, 04 Jul 2016 22:09:05 CDT","description":"<p><strong>(North America)</strong> <p><strong>THE OPPORTUNITY</strong></p><p><br></p><p>We are a pretty busy shop these days at Modern Tribe. We’re always looking to meet more HIGHLY DETAIL ORIENTED digital designers to join our team. We’ll either have a project that needs your help directly or, we’d like to have the chance to get to know you and your work for future opportunities that come up.</p><p>We're looking for experienced designers, comfortable working at any point in the design process. Our designers are experienced in UX, love research, insist on wireframing, and are comfortable reading and writing spec documents. Whether we're designing applications, new products, or websites – our designers are focused on empowering users and achieving results.</p><p>We're looking for people that equally at home in visual design. You recognize that business objectives and user objectives trump personal preferences. You've got a passion for typography, grid systems, and recognize that words are design tool. You know that any thing you design works as part of a larger system.</p><p>Above and beyond your individual talents, we're looking for someone to join our team. We're a very collaborative bunch, eager for feedback. The work we execute is the product of the team. If you're excited about learning from others, and helping others - you'll find a good home here.</p><p>If that sounds like you, get in touch.</p><p><br> <strong>THE KINDS OF PEOPLE WE LIKE</strong></p><p><strong>Modern Tribe</strong> is a digital agency with a modern twist. We are a product company. We are educators. All freelancers. All experts. In today’s world, we get to be many things to many people.</p><p><strong></strong></p><p>We believe in making quality products for other people and ourselves, balanced by living quality lives. We are 100% distributed & our team is spread around North America (and a touch in Latin America & Europe). We believe in a class of artisans and craftsman in control of their work who solve people problems rather than just build more crap. We believe in a sustainable vision of open source, and contribute consistently into the ecosystem.</p><p>We love working with each other because we have built a culture that suits us well. We work exclusively with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul>\n<li><strong>Happy</strong>: Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li>\n<li><strong>Helpful</strong>: Always looking for ways that you can help others.</li>\n<li><strong>Curious</strong>: It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li>\n<li><strong>Accountable</strong>: Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li>\n</ul><p><strong><br>LOCATION</strong></p><p>Work from anywhere in the <strong>US or Canada...</strong>or around the the world, so long as you are completely and genuinely fluent in English and work during US hours. There is an opportunity to work in our office in Minneapolis as well.</p><p><a target=\"_blank\"></a><br><strong>RESPONSIBILITIES</strong></p><ul>\n<li>Execute design thinking tactics - write user profiles and flows</li><li>Transition strategic work into wireframe and ux guides for a wide variety of experiences</li><li>Integrate stringent brand guidelines to create a rich look and feel</li><li>Take UI screens to PSD, give them a personality and polish them to a shine. Get the gutters, corners, colors, fonts … consistent and clean</li><li>Make sure that design elements are used correctly across an entire system</li><li>Work with the development team to realize designs, conduct design QA, and aid in interaction design</li>\n</ul><p><strong><br>BONUS</strong></p><ul><li>Experience in content creation, marketing, and copywriting</li><li>Demonstrable history of product definition and design</li><li>Understanding of product development lifecycle</li>\n</ul><p><a target=\"_blank\"></a><br><strong>PERSONAL COMPETENCIES</strong></p><ul><li>Self-motivated, detail-oriented, strong organizational skills, with a methodical approach to all tasks</li><li>Strong communication and/or experience working as part of a remote team</li><li>Ability to prioritize own workload and work to exacting deadlines</li><li>Ability to maintain strict confidentiality</li><li>Desire to constantly learn about the industry</li><li>Fluent English speaker</li>\n</ul><p><a target=\"_blank\"></a><br><strong>REQUIRED KNOWLEDGE AND EXPERIENCE</strong></p><ul>\n<li>Strong Photoshop Experience</li>\n<li>Passion for Detail and Standards</li>\n<li>Full-Time Freelancers ONLY</li>\n</ul><p><br><strong>COMPENSATION</strong></p><p>Pay range is USD <strong>$30-60 per hour</strong> commensurate with background, qualifications and experience. We often start our freelancers on a one time contract position (though we are always seeking long standing relationships with kick-ass people).</p></p><p><strong>Job Perks:</strong> We understand what it means to be a freelancer. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. You can expect to learn a lot while working with us.</p><p><strong>Apply:</strong> After you've read the gig listing in full, fill out the form below to apply. Make sure to include ALL of this requested information, or your application risks not being processed:\n\n-A link to your LinkedIn or resume\n\n-A link to your portfolio or a list of sites / apps you have designed\n\n-Your favorite color (that way we know you read this)\n\n-Answers to the following questions:\n\n1. Are you currently a full-time freelancer? If so, for how long?\n\n2. What hourly rate are you looking for?\n\n3. What was the coolest design project you worked on over the past year? What made it so awesome?\n\n4. What is your availability?</p>"},{"title":"Modern Tribe Inc: QA for High Profile WordPress Sites","link":"http://authenticjobs.com/jobs/27592","pubDate":"Fri, 01 Jul 2016 09:33:37 CDT","description":"<p><strong>(Anywhere (100% distributed team))</strong> <p><a href=\"http://tri.be/\" target=\"_blank\">Modern Tribe’s</a> QA team works on a lot of cool projects: over the past year alone, we’ve tested sites built by our dev team for big-name clients including <a href=\"http://columbialawreview.org/\">Columbia Law School</a>, <a href=\"http://www.foodinnovationgroup.com\">Bon Appetit Magazine</a>, <a href=\"https://www.eventbrite.com/blog/academy/\">Eventbright Academy</a> Blog, <a href=\"http://hls.harvard.edu/\">Harvard Law School</a> and <a href=\"https://www.whatshouldwedo.com/\">What Should We Do (WSWD)</a>. (Want to see how we did? The links above highlight some of our work). And that’s not even including our family of WordPress plugins led by <a href=\"http://theeventscalendar.com\">The Events Calendar</a>.</p><p>We’ve got a slew of cool projects we are working on from now through early 2017, and need another member for our QA team. If working on high-profile sites for large clients gets you excited and a serious case of attention to detail is your jam, we should talk.</p><p><strong>Who Are We?</strong></p><p><a href=\"http://tri.be/\">Modern Tribe, Inc.</a> is a rapidly growing software & design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North & South America (and a smattering across the globe).</p><h2>Who You Are</h2><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>HAPPY</strong> Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>HELPFUL</strong> Always looking for ways that you can help others.</li><li><strong>CURIOUS</strong> It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>ACCOUNTABLE</strong> Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul><p><strong>Details About the QA Gig</strong></p><p>QA is responsible for ensuring all aspects of quality at Modern Tribe. It’s a tall order for sure: learning how a site works, creating test plans covering obscure use cases, and then putting it all into practice when testing every aspect of site functionality…it’s a lot of ground to cover. But we’ve got an established workflow down that helps make sure we’re setting the team up with the tools they need to proceed and succeed.Though every project is different, here’s the gist of our QA flow:</p><ul>\n<li><strong>Kickoff meeting.</strong> Just a kickoff — meet the PM; get your questions answered; set expectations; and schedule milestones.</li>\n<li><strong>Preparing docs.</strong> Getting started with internal documentation early is hugely important to getting the project into your brain.</li>\n<li><strong>Review approved comps.</strong> Before you start QA or even get a walkthrough, you’ll review the comps to understand the project + prepare a list of questions to ask on the QA walkthrough.</li>\n<li><strong>QA walkthrough.</strong> Once development is far enough along for QA to begin, you’ll do a walkthrough with the lead developer to get an overview of the functionality.</li>\n<li><strong>Prepare QA checklist + test plan.</strong> After seeing each component of the site in action, you’ll put together a first draft at a comprehensive QA checklist and a higher-level overview of what you’re planning to test, in what order, and when.</li>\n<li><strong>Heavy duty testing.</strong> You’ll put the site through its paces and give it a few rounds of full pass bug hunting. Beyond just hitting buttons, you’ll be thinking from a higher level: are there usability concerns? Does what we’re doing here actually make sense as the best way to solve the problem? etc.</li>\n<li><strong>Celebrating a successful launch.</strong> What feels better than kicking back after a successful launch? If QA has done their job, the project will launch smoothly, the team will have a finished product to show off, and — most importantly — the client will be happy. It doesn’t get much better than that.</li>\n</ul><p>Our QA team also generally leads client training and prepares training documentation/videos when appropriate, so be prepared for some direct client communication.</p><p><strong>The Right Candidate</strong></p><p>We’re looking for someone who:</p><ul>\n<li><strong>Has a proven track record in Quality Assurance.</strong> Automated testing experience is a bonus, but the majority of our QA is manual and requires a heavy degree of hands-on testing. Be prepared to provide examples of past experience.</li>\n<li><strong>Pays meticulous attention to detail + fights for the customer.</strong> Being able to catch bugs is huge, but it isn’t everything — QA is most effective when it puts itself in the customer or end user’s shoes.</li>\n<li><strong>Knows WordPress well.</strong> It’s tough coming in and having to learn WordPress and our QA systems at the same time. Through a (paid) test project, you’ll be expected to prove your familiarity with the platform.</li>\n<li><strong>Has 1+ year remote freelancing experience.</strong> Full-time freelancers are the only candidates we’re looking for at this time; we are not seeking F/T or P/T employees, nor can we work with somebody moonlighting from a full-time gig. And if you haven’t worked remotely before, this probably won’t be a good fit.</li>\n<li><strong>Likes working with a diverse group of awesome people.</strong> Since Modern Tribe is an entirely remote company, you’ll work with people from all over the world who you might not cross paths with at a traditional office gig. And when we get together for our yearly team-wide retreat (usually in warm exotic locale where the food is cheap and the wifi is spotty), there’s no telling what types of friendships will emerge once everyone is in the same room.</li>\n</ul><h3><p>Location</p></h3><p>Work from anywhere in North, Central or South America. Please do not apply if your timezone is outside of the US range and if you are not totally fluent in English. You just need a computer and a strong wifi signal to support daily video chats with the Tribe. But note that we are looking for team members to have at least 3 hours of overlap each day with the rest of your project team.</p><p><strong>Compensation</strong></p><p>Our hourly rate for this gig starts at<strong> $30-$40/hr</strong>, depending on experience, with opportunities for rate bumps on annual review.  This gig is about <strong>10-20 hours</strong> per week of work.  This is a one time contract position, though we are always seeking longer relationships with kick-ass people.</p><p><br></p><p><em><strong>NOTE:</strong> Modern Tribe thrives from having a diverse workplace. We do not discriminate against prospective contractors on the basis of race, religion, color, gender identity, age, veteran status, sexual orientation, marital status, physical/mental disability, or other protected classes. </em></p></p><p><strong>Job Perks:</strong> We believe distributed working is a way of life. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. Also, if you work enough with us, we’ll bring you on the team trips (see http://tri.be/blog/team-trip-2016/).\n</p><p><strong>Apply:</strong> We’re excited to hear from you! BEFORE APPLYING, please read this gig listing carefully. So many people seem to apply without actually reading it. Once you’ve read the listing in full and are confident you’re ready to rock, hit the “Apply” button and fill out the form.\n</p>"},{"title":"MWI: Full Stack Web Developer","link":"http://authenticjobs.com/jobs/27582","pubDate":"Tue, 28 Jun 2016 17:53:58 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong>Location: </strong>Anywhere</p><p><br><br><strong>Benefits:</strong> Work from home, set your own hours, unlimited vacation, full medical/vision/dental benefits (we pay full amount of premiums), work with friendly people who are experts at what they do, make a real difference, etc.</p><p><br><br>Let’s cut to the chase–you’re awesome, we’re awesome, we really should get together. But we believe in dating before getting married, so we prefer testing things out with a contract project or two where possible to allow you to see if you like us, help us to see if we like you, and if all goes well, then we’re not afraid of commitment. And we’re ready to move fast. We’ve got a lot of work coming in. </p><p><br><br>As a front end developer at MWI you’ll be developing creative solutions for MWI clients, solving problems and challenges in real time as they come up, doing things that have never been done before, amazing everyone with your coding skills, and becoming Internet-famous. Plus working with awesome people who are just as excited as you are about changing the world.</p><p><br><br><strong>Responsibilities:</strong></p><ul>\n<li>Communicate with clients to gather requirements and assess their objectives during the pre-development and development stages of projects, including making presentations individually or as part of a team.</li>\n<li>Work with other MWI employees, including copywriters, UX designers, web designers, other coders, and digital marketers.</li>\n<li>Assist with creating proposals and agreements for web development engagements.</li>\n<li>Think strategically and come up with creative and elegant solutions for clients.</li>\n<li>Develop, debug, and assist with development tasks.</li>\n<li>Own projects from conception to completion.</li>\n</ul><p>Must Haves:</p><ul>\n<li>5+ years experience developing fully customized WordPress themes.</li>\n<li>Experience developing pixel perfect responsive websites from PSD’s.</li>\n<li>Expert level fluency with HTML/HTML5, CSS/CSS3/Jquery.</li>\n<li>Experience with jQuery, Prototype, AngularJS, Node.js.</li>\n<li>Strong knowledge of responsive web design and development.</li>\n<li>Strong understanding of PHP/MySQL.</li>\n<li>Experience with version control.</li>\n<li>Understanding of cross browser/device development techniques.</li>\n<li>Experience in cross browser support and graceful degradation.</li>\n<li>Familiarity with open source frameworks.</li>\n<li>Experience integrating with and debugging content management systems.</li>\n<li>Familiarity with SEO best practices a plus.</li>\n<li>Experience with ecommerce (Woocommerce), integrating with merchant API’s, and security.</li>\n<li>Experience with WordPress frameworks (Genesis) a plus.</li>\n<li>Comfortable working in a variety of CMS’s, frameworks and templating systems (BigCommerce, Shopify, etc).</li>\n</ul><p>Requirements:</p><ul>\n<li>Strong communication and interpersonal skills.</li>\n<li>Ability to manage time and to work with little to no supervision.</li>\n<li>Coding addicts preferred.</li>\n<li>Current knowledge on upcoming technologies and w3c compliant code.</li>\n<li>Familiarity with good principles of UX, front-end coding, and web design.</li>\n</ul><p><strong>Wondering what it’s like working for MWI?</strong></p><p><br><br><em>\"MWI is a great company if you are looking for growth. MWI offers employees the opportunity to contribute to all forms of planning and discussions. We’re not only open to improvement were constantly striving for it. MWI offers room for career growth and personal career development. At MWI you’re surrounded with great team members who enjoy collaboration. I’ve worked monotonous coding positions before and this is not one of those. Every day presents exciting turns and new opportunities to stretch the mind, contribute with innovative ideas, and learn new skills. We’re looking forward to see what new ideas and contributions you’ll bring to our team.\"</em><br>Michelle Payne – Project Manager/Lead Developer</p><p><br><br><em>\"MWI is an awesome company to work for and it’s great to be able to work with people who know what they are doing and are good at doing it. It’s a place where people work hard and your opinions and ideas are heard no matter who you are or what your specialty or skill set may be. Your efforts are noticed and they do not hold back appreciation or gratitude. Work hard, and you can have an immediate impact on the company in a good way. And let’s be honest, it’s never a bad gig to work from home.\"</em><br>Robert Davis – Senior Web Developer</p></p><p><strong>Job Perks:</strong> Unlimited vacation, results oriented workplace. We don't care where, when, or how you work, as long as great work gets done.</p><p><strong>Apply:</strong> Email us a link to your Linkedin, Github, or other relevant accounts, along with a brief explanation of why you would do an awesome job in this position.</p>"},{"title":"Manning Publications: UI/UX Designer","link":"http://authenticjobs.com/jobs/27579","pubDate":"Tue, 28 Jun 2016 13:27:59 CDT","description":"<p><strong>(Anywhere)</strong> <p>Manning is an independent publisher of computer books for software developers, engineers, architects, system administrators, managers and all who are professionally involved with the computer business. We also publish for students and young programmers, including occasionally for children. We are an entirely virtual organization based on Shelter Island, New York, with many staff working from far-flung places like Manila and Zagreb.</p><p>We are looking for a UI/UX designer who will work on a new publishing product - a video course that runs in a web application. Through innovative UI/UX design, the candidate will help us develop a learning experience that maximizes understanding and retention. In addition to the main project design, the designer will also help us create templates and other assets.</p><p>The successful candidate will have relevant experience in this area and will feel comfortable discussing learning methods and competing products. Most instructions will come through Skype meetings as opposed to formal documents. The candidate will be available for these meetings during US business hours. We expect the project to last several months. </p><p>We look forward to hearing from you. We'd love to see examples of your work, and to know what your hourly rate would be.</p><p><br></p></p><p><strong>Apply:</strong> </p>"},{"title":"Simply Accessible: Accessibility Strategist/Consultant","link":"http://authenticjobs.com/jobs/27576","pubDate":"Mon, 27 Jun 2016 22:41:04 CDT","description":"<p><strong>(Anywhere)</strong> <h1>Accessibility Strategist / Consultant</h1><ul><li>EXPERIENCE REQUIRED: 5 years minimum as an Accessibility consultant and significant involvement in process innovation/improvement in design and development; You have demonstrated success with Enterprise level clients, either working internally for those clients, or externally at an agency.</li><li>JOB TYPE: Freelancers/Contractors at 20 to 40hrs/wk; Full-time employees at 40 hrs/wk</li><li>DURATION: 3 to 6 months (or more) contract; up to permanent full-time position</li><li>LOCATION: Remote. As in, wherever you are, not as in Antarctica.</li><li>WORKING LANGUAGE: You have exceptional written and spoken English communication skills</li><li>TIMING/HOURS: You’ll be working an 8 hour span, somewhere between 9am GMT and 3am GMT. The hours will depend on our clients and where you are.</li></ul><p><em>A letter our clients wrote…</em></p><p>Some people don’t know this, but we’ve managed to figure out short-term time travel here at Simply Accessible. We just jumped ahead a year, and received an email from our biggest clients — they got together, compared notes on how you worked with them, and they wrote a letter, praising you and your work. Here’s what they said:</p><p>Dear Accessibility Strategist,</p><p>We wanted to write you to let you know just how important your work was this past year in getting our accessibility program off the ground. Not only that, but you were a pleasure to work with. You’re a gem, and we wanted you to know it!</p><ol><li>You made it your quest to make all the things we did sustainable. This wasn’t just about doing one project well, but doing all of them well, and integrating accessibility into the culture of the organization. While we were looking directly at the work right in front of us–solving accessibility problems issue by issue–you taught us to think beyond the here and now. You helped us focus on what we needed to do in the next 2 months AND on what we needed to be working on 6-12 months out.</li><li>You taught us to recognize which accessibility issues can be treated like simple bugs, and which ones need higher level decisions, discussions, and a cohesive site-wide strategy. Our favourite thing you created for us was “Error messaging strategy for our site of awesome.” We know you have much more of that in you, and we can’t wait to read what you come up with next! You made sure all the decisions we made were properly captured and incorporated into our pattern library with the right accessibility considerations. Magic!</li><li>We were overwhelmed, at first, with the massive influx of information and detail about accessibility. You helped us review and interpret testing results from automated testing tools, manual testing results, and usability testing sessions. You helped us recognize high priority items. You helped us understand risk. And, we appreciated it most when you helped us stop focusing on “perfect by end of year” and start focusing “getting better every month.”</li></ol><p>You’re a natural teacher, and it showed in everything you did with us. We can’t thank you enough for all the things you taught us about improving our development processes and practices. You helped us see that accessibility was more than just code. You showed us the impact that both design and content have on accessibility. You’re a champion on behalf of people with disabilities everywhere.</p><p>And thank you most of all for holding us to a higher standard. You pushed us to get better with accessibility in every way. Our internal teams really appreciated how you worked with us–we know we always wanted you to spell things out in black and white, but we appreciate more than ever that no matter what we worked on together, you taught us to see that there is much more to accessibility than the checklist we were using when we first started.</p><p>We are still on our accessibility journey, but thank you for helping us chart the course for long-term success!</p><p>Sincerely,</p><p>All the clients you worked with in the last year.</p><p>Pretty good letter isn’t it? We’re ecstatic to have received it, and we’re really looking forward to hiring you!</p><h3><em>Now, time travel back to today…</em></h3><p>We are a small, close-knit team that works with clients in retail, travel, financial, health care, government, and other industries. Some are long-standing Fortune 500 businesses. Others are new startups. The work we do is always a challenge because while accessibility is conceptually very easy to understand, getting the execution right at scale is very hard.</p><p>Our team is empathetic, collaborative, and we’re passionate about teaching and empowering our clients with best practices to improve their accessibility programs. Our team will be working on a few things: assessing our clients’ digital properties for accessibility through design reviews, accessibility and usability testing; supporting them as they address those issues; and helping build sustainable accessibility into their design and development practices. Your main focus as a Strategist and Consultant will be to advocate for our clients, work with our Product Owners and Scrum Masters to clear the way for great work to be done, and be the sherpa that we need for project success!</p><p>Excited at that prospect? Have the experience and desire? Good! Us too…</p><h2><em>So, how do we get there?</em></h2><p>Let’s start with introductions. Tell us why you want to work here at Simply Accessible.</p><p>Let us know whether you’re looking to come on board as a contractor or employee. Send us links to your Twitter and LinkedIn profiles, or your portfolio. Tell us about why you want to help make the web easier to use for people with disabilities. Show us how your experience and character fits at Simply Accessible. We’ll go through your message and materials and take it from there. Looking forward to meeting you!</p></p><p><strong>Apply:</strong> </p>"},{"title":"SmartBug Media: Junior Front-End Developer","link":"http://authenticjobs.com/jobs/27575","pubDate":"Mon, 27 Jun 2016 16:11:37 CDT","description":"<p><strong>(Anywhere USA)</strong> <p><strong>We hire the best people for each position and embrace qualified and responsible remote staff, regardless of location. If this opportunity screams that’s me! – we should talk.</strong></p><ul><li>Are you a skilled front-end developer looking to work on some fun and fast paced projects?</li><li>Are you looking to work with really bright people who respect you for your contributions and character?</li><li>Do you want to dominate your career without killing your personal life?</li><li>Are you looking to create some great work without the grind of being in an office everyday?</li></ul><p>If so, you should consider becoming one of our front-end developers. In addition to creating stunning websites and experiences that deliver measurable impacts for our clients, our development team is valued for their contributions, ideas and process improvements. You’ll have a seat at the table as we adopt new technology, build and implement best practices and have a great time doing it. <strong>This junior position has room to grow into great opportunities.</strong></p><p>We’re looking for responsible developers that have experience working remotely and delivering high quality work. We also want you to be a long-standing member of our team that will look back years from now and be thrilled that you have made the right decision. You’ll be challenged everyday and will gain valuable experience working with different CMS platforms and marketing automation and analytics tools such as HubSpot.</p><p>We’re building a different kind of agency — one that lets you do great work without the sweat shop grind many agencies are known for. We’re building an agency where people can deliver great results, have a great time with people you respect and still embrace the things that matter in life.</p><h2><strong>Requirements</strong></h2><ul><li>1-3 years of experience developing sites and templates using HTML, CSS, and JavaScript (including HTML5 and CSS3)</li><li>Experience with PHP and WordPress</li><li>Experience with JavaScript frameworks such as jQuery</li><li>Strong knowledge of Bootstrap</li><li>Strong understanding of web development</li><li>Constantly test for browser and cross-platform compatibility based on industry standard practices</li><li>Keenly aware of the latest UI and consumer trends</li><li>Experience interfacing with designers and solving solutions</li><li>Experience developing responsive websites for desktop, tablet, and mobile devices</li><li>Replicate the full integrity of the original design with pixel-perfect precision.</li><li>Experience working in environments that are less rigid and open to developer input</li><li>Strong written and verbal communication and the ability to communicate challenges to project management and business leaders</li><li>Is extremely proactive in identifying, troubleshooting and addressing issues as they arise.</li><li>Strong teamwork mentality</li><li>History of working remotely in similar positions</li><li>Documented record of hitting dates</li><li>Experience using project management and bug tracking tools</li><li>Proficient in Adobe Photoshop and at least a working knowledge of Illustrator</li><li>Proficient in Microsoft Office and Google Docs</li><li>A portfolio website of your work</li></ul><h2><strong>Nice To Have</strong></h2><ul><li>Experience coding HubSpot COS a plus</li><li>Understanding of and experience implementing SEO a plus</li><li>B.S. in Computer Science or Equivalent</li></ul><h2><strong>Key Attributes</strong></h2><ul><li>Excellent teamwork skills and the ability to deliver high-quality work with little supervision</li><li>Obsessive debugger and process improver</li><li>Not afraid to speak up and contribute to a better project</li><li>Values, ethics and integrity</li><li>Strong attention to detail</li><li>Fun to work with</li></ul><h2><strong>About SmartBug Media</strong></h2><p>SmartBug Media is a fast-growing and nationally recognized inbound marketing agency. We’ve built our name and client base by delivering game-changing marketing campaigns that increase traffic, leads, customers and brand value. That’s why we are recommended by some of the biggest names in inbound marketing and have a client roster that’s growing by the day.</p><p>We are a 25-person virtual company that believes you shouldn’t have to compromise work/life balance in order to deliver great work, and we believe that you can do this from anywhere.</p></p><p><strong>Apply:</strong> </p>"},{"title":"SitePoint: PHP Channel Editor","link":"http://authenticjobs.com/jobs/27558","pubDate":"Fri, 24 Jun 2016 01:39:43 CDT","description":"<p><strong>(Anywhere)</strong> <p>SitePoint is looking for an experienced PHP developer with strong writing, video editing skills and a passion for sharing their knowledge to work as the editor of our PHP channel within SitePoint Premium. </p><p>The role involves growing a team of contributors to commission and publish video screencasts and courses relevant to our audience of PHP developers. You'll set the agenda for your channel, find new contributors, work with them to develop content ideas, perfect their video content, provide code reviews and publish and promote the final video content.</p><p>The role involves a time commitment of at least 15 hours a week, but that can be expanded to suit your availability. You'll work remotely and have the freedom to set your own hours. </p><p>SitePoint is a hub for web developers to share their passion for building incredible Internet things. Founded by Mark Harbottle and Matt Mickiewicz in 1999, SitePoint is for web professionals, by web professionals: developers, designers, programmers, product creators and entrepreneurs alike. Since 1999, we have published more than 20,000 books and articles that help more than 10 million readers per month become better web developers. We publish articles, books, video tutorials, courses and newsletters.</p></p><p><strong>Apply:</strong> Please send your CV along with any supporting materials that you think will support your application. </p>"},{"title":"Modern Tribe: WordPress Frontend Developer","link":"http://authenticjobs.com/jobs/27554","pubDate":"Thu, 23 Jun 2016 17:04:19 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong></strong><strong><a href=\"http://tri.be/\">Modern Tribe</a></strong> is looking for a talented <strong>WordPress frontend developer</strong> in North America to join our team as a part-time employee. (If you are in Central or South America and think you’d be a good fit – lets talk).</p><p>Do you have a dog eared copy of <a href=\"http://ejohn.org/blog/secrets-of-the-javascript-ninja-released/\">‘Secrets of the JavaScript Ninja’</a> beside your bed? Would you be excited to work on large scale WordPress projects that actually require your JavaScript skills? Would you be stoked to push the limits of where JavaScript and WordPress can play nicely together?</p><p>The opportunity calls for a mixed set of skills. We need someone with expert level CSS skills, impeccable WordPress experience, and solid JavaScript, PHP & MySQL skills. Experience building sites with extremely large loads is a plus. We like our stuff to run fast and smooth. We are looking for a unique snowflake – maybe it’s you?</p><h2>Who We Are</h2><p><a href=\"http://tri.be/\">Modern Tribe, Inc.</a> is a rapidly growing software & design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North & South America (and a smattering across the globe).</p><h2>Who You Are</h2><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>Happy:</strong> Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>Helpful: </strong>Always looking for ways that you can help others.</li><li><strong>Curious: </strong>It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>Accountable: </strong>Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li></ul><p>We’re currently working on high-profile WordPress implementations that range between conventional to seriously bleeding edge. We will want to see plugin code examples – public plugins are ideal. We want people that are able to develop code that can withstand high profile sites and intense loads. You should be comfortable working as part of a team – your code will have to integrate into an existing architecture. If tightly optimized code get’s you excited – you’re probably a good fit.</p><p><strong>Responsibilities</strong></p><ul><li>ARCHITECT: Work with design team to architect and document theme solutions using best practices</li><li>ADAPT: Integrate code into existing theme architecture</li><li>COLLABORATE: Coordinate with designers, back-end developers and other theme devs</li><li>PERFORM: Produce code solutions that load quickly and smoothly</li><li>REVIEW: Be a part of QA team and optimize / review other team members’ code</li></ul><h3><p style=\"font-style: normal; font-variant: normal; font-weight: normal; font-family: freight-text-pro, serif;\"><strong>Personal Competencies</strong></p></h3><ul><li>Strong communication skills</li><li>Experience working as part of a remote team</li><li>Self-motivated, detail-oriented</li><li>Strong organizational skills</li><li>A methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Fluent English speaker</li></ul><p><strong>Required Knowledge & Experience</strong></p><ul><li>Knowledge of WordPress theming best practices</li><li>Experience with LESS or Sass</li><li>Comfort in advanced JavaScript projects</li><li>Mid level to advanced PHP Skills</li><li>Basic LAMP / LEMPS skills</li><li>GIT</li><li>Proficiency at local environment development</li><li>Experience with extending and customizing the WordPress media manager and other JavaScript in the WordPress admin</li><li>Experience with API requests and parsing responses in JavaScript</li></ul><p><strong>Additional Experience (Bonus Points)</strong></p><p><strong></strong></p><ul><li>Examples of plugins / code that you’ve released to the open source community</li><li>Experience with es2015 and Babel</li><li>Advanced WordPress debug skills</li><li>Apple Mac dev environment</li><li>Experience with JavaScript templating. We like: Angular, Backbone, Handlebars, React and Underscores templating. Basically we hope you will be pro at one of the many different templating options out there right now.</li></ul><h3><p style=\"font-style: normal; font-variant: normal; font-weight: normal; font-family: freight-text-pro, serif;\"><strong>Location</strong></p><p style=\"font-style: normal; font-variant: normal; font-weight: normal; font-family: freight-text-pro, serif;\"><strong></strong></p></h3><p>Work from anywhere in <strong>North, Central or South America.</strong> Please do not apply if your timezone is outside of the US range and if you are not totally fluent in English. You just need a computer and a strong wifi signal to support daily video chats with the Tribe.</p><p><strong>Compensation</strong></p><p>Pay range is between <strong>$35-$50 US </strong>per hour commensurate with qualifications and experience. The gig is about <strong>10-15 hours </strong>a week of work. This opportunity is for a <strong>part-time job</strong>, though we are always seeking longer relationships with kick-ass people.</p><section></section><p><br></p></p><p><strong>Job Perks:</strong> We believe distributed working is a way of life. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. Also, if you work enough with us, we’ll bring you on the team trips (see http://tri.be/blog/team-trip-2016/).</p><p><strong>Apply:</strong> BEFORE APPLYING, please read this gig listing carefully. So many people seem to apply without actually reading it. Once you’ve read the listing in full and are confident you’re ready to rock, hit the “Apply” button and fill out the form.</p>"},{"title":"Milkshake Studio: Front-end/Full Stack Engineer","link":"http://authenticjobs.com/jobs/27533","pubDate":"Tue, 21 Jun 2016 15:36:29 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong></strong><strong>About the Position</strong></p><p>Milkshake Studio is looking for an experienced, design-savvy Full Stack Engineer to join our team.  As a Milkshake developer you will be working on both large complex products and smaller whimsical sites. You will be responsible for back-end architecture, front-end stack, exploring new technologies, and everything in-between.</p>\n<p>We are a small team of creatives, technologists, strategists, and doers. We value self-starters, pushing the envelope of existing technologies, pixel perfect web experiences, code quality and keen collaborators.  </p>\n<p><strong>Some stuff about you:</strong></p><ul><li>You have strong skills in HTML/HTML 5 & CSS/CSS3, LESS, Javascript, JQuery, php or python, AngularJs/vue.js (plus)</li><li>You have experience working with Agile methodologies and environments </li><li>You are detailed oriented</li><li>You’re nice and work hard </li><li>You care about clean code</li><li>You are not discouraged by feedback </li></ul>\n<p><strong>Bonus Points</strong></p><ul><li>You have experience working with mobile apps</li><li>You have experience working on technology for creative fields</li></ul>\n<p><strong>Compensation:</strong></p><ul><li>Competetive compensation</li><li>Snacks and beer</li><li>Freedom to work from anywhere</li><li>Flexible schedule</li></ul></p><p><strong>Apply:</strong> Please send through a portfolio and github url.</p>"},{"title":"Close.io: Senior UI/JavaScript Frontend Engineer","link":"http://authenticjobs.com/jobs/27521","pubDate":"Mon, 20 Jun 2016 18:45:43 CDT","description":"<p><strong>(Anywhere)</strong> <h3>ABOUT US</h3><p>At <a href=\"http://close.io/\">Close.io</a> we’re building the sales communication platform of the future. We’ve built a next-generation CRM that eliminates manual data entry and helps sales teams close more deals. We are hiring engineers to help us unify the world's sales calls and emails into one beautiful workflow.</p><p>Our app’s front-end is a single-page HTML5/JavaScript web app written with Backbone.js, jQuery, RequireJS, Handlebars, QUnit, Grunt, etc. It’s built entirely on top of our public REST API and targets only modern browsers. Our UI updates in near real-time and is written in LESS/CSS atop Bootstrap.</p><p>We ❤ open source – using 40+ frontend libraries/plugins with contributions to many of them.</p><h3>ABOUT YOU</h3><p>We're looking for experienced full-time developers to join our core team who have a strong understanding of web technologies and want to help design, implement, and launch major user-facing features.</p><h3>YOU SHOULD...</h3><ul><li>Have 3+ years experience building modern front-end applications in JavaScript, HTML5, and CSS</li><li>Have great product sense and be able to think through user experience issues before diving into the code</li><li>Write maintainable, testable, and performant JavaScript</li><li>Have a love for great UI</li><li>Enjoy debugging all aspects of the front-end app including memory leaks and quirky CSS across browsers</li><li>Have experience implementing real-time (e.g. websockets, polling, etc.) web apps</li><li>Have significant experience with REST APIs and thoroughly understand HTTP requests</li></ul><h3>BONUS POINTS IF YOU...</h3><ul><li>Have an eye for design and experience with Photoshop, Sketch, or similar</li><li>Have contributed open source code (core or plugins) for a popular frontend framework such as Backbone, Angular, or React</li></ul><h3>WHY WORK WITH US?</h3><ul><li>Work remotely from anywhere in the world! Just be willing to do a bit of traveling every year for some face-to-face time with the whole team :)</li><li>Help build a truly successful SaaS company with a stellar team where you can have a huge impact.</li><li>Above market salary and benefits</li><li>Fun company culture that embraces a healthy work/life balance</li></ul><h3><br></h3></p><p><strong>Job Perks:</strong> Work from anywhere in the world! Excellent Health, Dental & 401k for US residents. $$$ Bonuses for notable overachievement. Paid travel and expenses to Team Retreats (2-3 times a year)</p><p><strong>Apply:</strong> </p>"},{"title":"Modern Tribe: Experienced Digital Project Manager","link":"http://authenticjobs.com/jobs/27509","pubDate":"Fri, 17 Jun 2016 18:04:34 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong><a href=\"http://tri.be/\">Modern Tribe</a></strong> is looking for a talented and experienced <strong>freelance digital project manager</strong> based somewhere in North America. We’re a WordPress agency so hopefully you have run some projects with the platform.\n</p><p>If you are drawn to order like a moth to a flame, then drop us a line. If you like maintaining lists and seeing team members make progress because you set them up to succeed, then you are perfect for this gig.\n</p><p>If you are skilled in agile, waterfall and whatever-suits-the-project techniques, then we should talk.</p><em>To be transparent, this is NOT a Digital Producer role. We have Strategists that you will be working with as well as UX team members. This gig is about organization and management more than it is about creative input.<p><br>\n</p></em><p><strong>Who We Are</strong></p><p>Modern Tribe is a rapidly growing software & design company. We develop custom solutions for some of the world’s largest companies, government institutions and smaller growing organizations. We pride ourselves on our ability to bridge people and technology and to bring the passion and dedication of an entrepreneur to every project. Our team is composed of talented employees and freelancers around North & South America (and a smattering across the globe).</p><h2>Who You Are</h2><p>We love working with each other because we have built a culture that suits us well. We work primarily with freelancers and coordinate their talents for large projects. To be on our team, you must be:</p><ul><li><strong>Happy: </strong>Where there is a will, there is a way. Having a positive disposition allows us to achieve great things and to support each other.</li><li><strong>Helpful: </strong>Always looking for ways that you can help others.</li><li><strong>Curious: </strong>It is essential that you have a passion for learning. Technology changes daily, and life has a way of constantly raising the bar.</li><li><strong>Accountable:</strong> Our clients expect us to get the right thing done on budget and on time. Communicating expectations and meeting them is the cornerstone of success.</li><li><strong>A Freelancer: </strong>This means that if you live within the USA, you will also maintain your own personal client list and that Modern Tribe will only comprise a proportion of your total income. Regardless of where you live, you need to be already freelancing.</li></ul><p>For this role specifically, you should feel comfortable wrangling a chaotic digital media project into an organized one. You should ask lots of questions and feel a need to. We are hoping you will not just project manage, but understand the project, the business goals and engage in the technology enough to be able to anticipate scope, budget and timeline challenges.</p><h2>Responsibilities</h2><p>Your primary responsibility is to shepherd the project to success. We pride ourselves on our projects arriving on time, on scope, on budget with a happy team and customer. You will create confidence through organization and oversee communication. To do this, you will need to:</p><ul><li>Manage scope, timeline and budget execution</li><li>Manage expectations for everyone on a project including the team, the account managers, and the customer</li><li>Run scrums and other status meetings</li><li>Review team hours</li><li>Write SOWs</li><li>Review budget</li><li>Set up and maintain tickets in the management system</li><li>Manage collection of assets and information from the customer</li><li>Perform meeting prep, prepare agendas, and handle all follow up</li><li>Produce weekly and monthly summary reports</li></ul><h2>Personal Competencies</h2><ul><li>Strong communication and/or experience working as part of a remote team</li><li>Self-motivated, detail-oriented, strong organizational skills, with a methodical approach to all tasks</li><li>Ability to prioritize workloads and meet deadlines</li><li>Ability to work independently with minimal oversight</li><li>Fluent English speaker</li></ul><h2>Required Knowledge & Experience</h2><ul><li>At least 5 years of experience working as a PM, ideally on a distributed web design / dev team</li><li>Experience with agile and waterfall management styles</li><li>Experience producing large CMS powered websites</li><li>A whiz when it comes to online collaboration tools. You feel at home when we talk about Slack, Google Hangout, Google Docs, Dropbox or any number of online PM tools.</li><li>Experience managing projects with budgets over $100k </li></ul><h2>Additional Experience (Bonus Points)</h2><ul><li>Experience with WordPress</li><li>Technical experience as a frontend or backend developer</li><li>Experience with enterprise level web development projects</li><li>Design experience</li></ul><h2>Location</h2><p>Given the nature of this role, we’re exclusively seeking applicants located in <strong>North America</strong> who have a <strong>perfect command of the English language</strong>. Please do not apply if you are not totally fluent in English or are located / work outside of traditional U.S. business hours.</p><h2>Compensation</h2><p>\nPay range is between <strong>$50-$60 USD</strong> per hour commensurate with qualifications and experience. The gig is about <strong>15-20 hours per week</strong> of work. This is a one time contract position, though we are always seeking longer relationships with kick-ass people.<br></p></p><p><strong>Job Perks:</strong> We believe that freelancing is a way of life. We offer consistency in expectations, payment, and support. We believe in learning from each other and fostering personal growth. Also, if you work enough with us, we’ll bring you on the team trips (see http://tri.be/blog/team-trip-2016/).</p><p><strong>Apply:</strong> BEFORE APPLYING, please read this gig listing carefully. So many people seem to apply without actually reading it. Once you've read the listing in full and are confident you're ready to rock, hit the \"Apply\" button and fill out the form.</p>"},{"title":"Modern Tribe: Account Exec / Sales","link":"http://authenticjobs.com/jobs/27510","pubDate":"Fri, 17 Jun 2016 18:04:34 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong></strong><strong>Modern Tribe</strong> is looking for a seasoned account executive / sales representative to join our growing team. A hybrid role between senior sales and marketing or project strategist, this position at Modern Tribe will help the company identify leads and close deals in line with our company values.</p><h1>The Ideal Candidate</h1><p>The ideal candidate for this role is someone who has been closing deals and maintaining key relationships for a successful digital agency for 2+ years and has been technically involved in online projects for 5+ years. </p><p>You’ve been running projects for years: you’ve done your own sales, have a proven track record  writing proposals, know how to work with WordPress, and understand the nuances of the WordPress business world. You’ve sold projects in the $50 - $150k+ range, and are looking to go bigger. </p><p>Above all else, your daily attitude + output embody Modern Tribe’s company ethos of <strong>“live well and do good work”</strong>: you thrive on keeping the team happy and healthy. Matchmaking -- not hitting sales numbers -- is your jam. You hustle hard, enjoy the game and relish a genuine success. We pride ourselves on solving real problems for people rather than clutter the interwebs with more shit. If you jive with the mission of setting your team up for success, giving them the right flow and the right kind of projects, even if it means rejecting a potentially-lucrative gig... we’d love to hear from you. </p><h1>Responsibilities</h1><p>Each of Modern Tribe’s sales team members closes upwards of $1 million in new project work each year. The company provides a healthy pipeline to keep things rolling. Team members are also expected to be out generating leads themselves through speaking at events, blogging, local networking, etc. We don’t do cold calls -- we build relationships. </p><p><strong>Note that scoping + strategy experience are a must-have for this role; Modern Tribe is not interested non-technical sales candidates at this time.</strong></p><p>The Account Exec / Sales position at Modern Tribe is primarily focused on <strong>lead generation and managing the sales funnel t</strong>hrough strategic proposals. Specific tasks this will involve include:</p><ul><li>Managing the inbound inquiry funnel (triage emails, answer calls, etc)</li><li>Reviewing + qualifying leads that are a good fit for Modern Tribe</li><li>Helping define + scope projects of all sizes, ranging from $35k to over $1 million +</li><li>Leading the proposal writing process</li><li>Working directly with service team directors / leads to get estimates</li><li>Pitching the final project / proposal to the end customer</li><li>Building relationships with prospective partners</li><li>Providing regular status updates on daily Sales scrum meetings</li><li>Working directly with Project Management and Strategy to handoff and oversee confirmed projects / upsell opportunities</li><li>Ensuring the internal CRM we use for tracking work stays updated + accurate</li><li>Verifying that that all workflows (proposal templates, estimate templates, etc) are documented and easily accessible</li><li>Maintaining strong, long-term relationships with customers once the project is underway</li><li>Writing outbound marketing pieces</li></ul><h3>Who You’ll Work With</h3><p>On joining Modern Tribe’s Sales team, you’ll be working hand-in-hand with our CEO <a href=\"https://twitter.com/justlikeair\">Shane Pearlman</a> and our lead sales / strategist <a href=\"https://twitter.com/travistotz\">Travis Totz</a>. Shane is a founding partner of Modern Tribe who has been <a href=\"http://tri.be/blog/how-to-land-a-top-shelf-agency-for-your-project/\">leading the company’s sales team</a> for more than a decade, while Travis is a former partner at Westwerk who <a href=\"http://tri.be/blog/our-family-gets-a-little-bigger/\">joined Modern Tribe in 2016</a>.</p><h1>Requirements</h1><p>We love working with each other because we have built a culture that suits us well. We work with a mix of freelancers and traditional employees, and coordinate their talents for large projects. Learn more about how our team works, what traits we look for in new team members and <a href=\"http://tri.be/careers/\">more here</a>.</p><h2>Location</h2><p>We are primarily seeking candidates located in <strong>America + Canada</strong>; if you’re outside North America but are within a 6 hour timezone difference (Central / South America or Europe) and still think you’d be a good fit, please apply and note why.</p><h2>Personal Competencies</h2><ul><li>Impeccable communication + organization skills</li><li>A deep-seated love for relationship building</li><li>A diverse background that touches on technology, design and/or strategy, not just sales</li><li>Self-motivated, detail oriented</li><li>The ability to prioritize workloads and meet deadlines</li><li>An engaging + compelling writing style</li><li>Given the level of client communication involved, a near-perfect command of the English language is required</li></ul><h2>Knowledge + Experience</h2><ul><li>2+ years managing sales for digital agencies</li><li>A strong, proven track record building + managing relationships</li><li>A strong design or technical background -- show us that you’ve been in the mix building stuff!</li><li>A demonstrable understanding of current technologies and what solutions will/will not work for a given customer’s needs</li></ul><h2>Bonus Points</h2><ul><li>A strong command of WordPress is HIGHLY desirable, but not required if you have years of experience selling or working with a similar CMS</li><li>Experience running web design and development projects & managing the customer relationship</li><li>Experience closing $1 million + in annual sales</li><li>Proven experience in strategy, design and/or executing major marketing initiatives</li><li>Distributed team experience is important (but not required)</li><li>A confidence + love for working remotely, and the potential social isolation that may bring</li></ul><h1>Compensation</h1><p>The sales role at Modern Tribe is a <strong>full-time job (35+ hours/weekly)</strong>. Full time salary between <strong>$65,000 - $100,000 USD</strong> depending on experience. Keep in mind that Modern Tribe’s sales team does NOT offer commissions at this time.</p><p>Work from home, or a coworking space, or join a small crew in the Minneapolis office. We are entirely location independent (North American hours required).</p><p><br></p></p><p><strong>Job Perks:</strong> We offer consistency in expectations, payment, support and a flexible schedule. You also get to come on our awesome annual team trips (see: http://tri.be/blog/team-trip-2016/).</p><p><strong>Apply:</strong> Make sure to select “Sales” from the list of options. BEFORE APPLYING, please take the time to read this job post carefully. So many people seem to apply without actually reading it.\n\nWith your application, make sure to include links to your resume and/or LinkedIn profile; the names, email addresses + telephone numbers of two references we can contact to get a better sense of your sales background; and a one-sentence teaser about the most exciting project you ever sold (don’t worry...we’ll ask you for the full story on your interview).</p>"},{"title":"Coalition Technologies: Laravel Developer","link":"http://authenticjobs.com/jobs/27501","pubDate":"Thu, 16 Jun 2016 17:09:27 CDT","description":"<p><strong>(Anywhere)</strong> <h3>WHY YOU SHOULD APPLY</h3><p>Our company is devoted to doing the best possible work for our clients and maintaining a fun, thriving environment for our team. You will work side by side with top talent to improve your skills and advance the company as a whole. We listen to your ideas and use them.</p><p>We offer opportunities for growth and training and the best profit sharing bonus plan in the industry. Up to 50% of all profits are paid out monthly to all full-time employees! We also offer paid time off for all remote team members.</p><h3>YOU SHOULD HAVE:</h3><ul><li>An expertise in PHP, MySQL, HTML5 and CSS3</li><li>A portfolio with live links to sites that you have developed previously (preferred)</li><li>Laravel experience</li><li>Expertise in other platforms such as WordPress (preferred)</li><li>The ability to convert PSD’s to Laravel and PHP sites</li><li>The ability to work on LAMP development environment</li><li>The ability to handle multiple projects and tasks at the same time</li><li>Great attention to detail and be highly organized</li><li>A reliable workstation with a fast computer, mic and speakers for calls.</li><li>Must have reliable internet and power (maximum of 1 hour of outage per month)</li><li>The ability to work hours similar to the rest of the Coalition Team (9am-6pm PST)</li><li>The ability to articulate yourself professionally</li><li>Excellent written and spoken English</li><li>The ability to adapt in a diverse and multicultural environment</li><li>A positive and upbeat attitude</li><li>Passion to build a startup</li></ul><h3>YOUR DUTIES AND TASKS:</h3><ul><li>Work daily in PHP, MySQL, JavaScript, JQuery and with the Laravel Framework</li><li>Build Laravel websites</li><li>Converting PSDs into pixel perfect responsive Laravel and custom PHP sites</li><li>Resolve cross-browser compatibility issues</li><li>Write clean structured and well-documented code</li><li>Integrate data with Sage, Quickbooks, WordPress, Salesforce and APIs in general and ERP/stock management systems</li><li>Work with LAMP development environment and version control GIT / SVN</li></ul></p><p><strong>Job Perks:</strong> Paid time off, monthly profit share bonuses, career development plan.</p><p><strong>Apply:</strong> </p>"},{"title":"Coalition Technologies: Back End Developer - PHP - Magento","link":"http://authenticjobs.com/jobs/27500","pubDate":"Thu, 16 Jun 2016 17:09:27 CDT","description":"<p><strong>(Anywhere)</strong> <p>WHY YOU SHOULD APPLY<br></p><p>Our company is devoted to doing the best possible work for our clients and maintaining a fun, thriving environment for our team. You will work side by side with top talent to improve your skills and advance the company as a whole. We listen to your ideas and use them.</p><p>We offer opportunities for growth and training and the best profit sharing bonus plan in the industry. Up to 50% of all profits are paid out monthly to all full-time employees! We also offer paid time off for all remote team members.</p><p>YOUR DUTIES AND TASKS:</p><ul><li>Work daily in PHP, MySQL, JavaScript, JQuery and with the Zend Framework</li><li>Build Magento Community websites and other platforms</li><li>Converting PSDs into pixel perfect responsive Magento and custom PHP sites</li><li>Resolve cross-browser compatibility issues</li><li>Write clean structured and well-documented code</li><li>Integrate data with Sage, Quickbooks, WordPress, Salesforce and APIs in general and ERP/stock management systems</li><li>Work with LAMP development environment and version control GIT / SVN</li></ul><p>YOU SHOULD HAVE:</p><ul>\n<li>An expertise in PHP, MySQL, HTML5 and CSS3</li><li>A portfolio with live links to sites that you have developed previously (preferred)</li><li>A Magento Certification (preferred)</li><li>Expertise in other platforms such as WordPress (preferred)</li><li>The ability to convert PSD’s to Magento and PHP sites</li><li>The ability to work on LAMP development environment</li><li>The ability to handle multiple projects and tasks at the same time</li><li>Great attention to detail and be highly organized</li><li>A reliable workstation with a fast computer, mic and speakers for calls.</li><li>Must have reliable internet and power (maximum of 1 hour of outage per month)</li><li>The ability to work hours similar to the rest of the Coalition Team (9am-6pm PST)</li><li>The ability to articulate yourself professionally</li><li>Excellent written and spoken English</li><li>The ability to adapt in a diverse and multicultural environment</li><li>A positive and upbeat attitude</li><li>Passion to build a startup</li>\n</ul></p><p><strong>Job Perks:</strong> Paid time off, monthly profit share bonuses, career development plan.</p><p><strong>Apply:</strong> </p>"},{"title":"Planning Center Online: Front End Designer","link":"http://authenticjobs.com/jobs/27499","pubDate":"Thu, 16 Jun 2016 15:08:50 CDT","description":"<p><strong>(Carlsbad CA, Anywhere for the right candidate)</strong> <p>We love our team. If you like working with talented people who genuinely care about the products they build, this may be a good fit for you. We are obsessive about creating the best possible experiences for our customers, which also means we get to work with the latest technologies to make that happen. All of us are passionate about what we do: designers, engineers, managers, customer support.... We eat together, learn together, and thoroughly enjoy our collaborative work environment.</p><p><br></p><p>Our customers love our products! They are our sales team. With 90 of the 100 largest churches in America using and loving our software, there is always work to be done, and we can assure you there are plenty of ways for you to contribute and leave your distinct mark on some amazing products.</p><p><br></p><p>We are looking for another enthusiastic designer to help us refine our current apps, conceptualize new ones, and increase product adoption by intelligent marketing practices. While working with us you will contribute directly to the vision and direction of our products. Every member of our team is critical to the design and decision making process and is equipped with the best tools to do his/her job—think: brand new decked out MacBook Pro and a company paid iPhone. Basically, you build your dream machine on <a href=\"http://apple.com/\" rel=\"nofollow\">Apple.com</a>, send us the link, and we will buy it!</p><p><br><br><strong>Requirements:</strong></p><p>As a member of the design team you must have a strong foundation in design principles, a good eye for design, and be able to present samples of your work. Planning Center Online designers are expected to know code. HTML, CSS, a familiarity with Javascript and Rails, or a strong desire to learn web technologies are essential for the person that will fit this role.</p><p>We would love a candidate who can spend most of their work hours with us in our main office. But, we are also dedicated to hiring the best talent available and will offer the option to work remotely for the right person. We fly our remote team out to the office about once a quarter to connect with the rest of the team.</p><p><br></p><p><strong>Bonus points for:</strong></p><ul>\n<li>Proven prior SEO or social media marketing experience.</li>\n<li>Experience designing based on split testing or other statistical analysis.</li>\n<li>Video Production (final cut, premiere pro, after effects...) experience</li>\n<li>Designing for accessibility</li>\n</ul><p><br></p><p><strong>Benefits & Digs</strong></p><p>Our main offices are located in Carlsbad, CA (near San Diego). Beautiful weather year round. A kitchen, play room, private team rooms, and several cool, comfortable lounge areas are some of the great things that we have purposefully designed into our new building. You can check out pictures, a video and some of our other amazing perks on <a href=\"http://get.planningcenteronline.com/careers\" rel=\"nofollow\">our careers page</a>.</p><p>Our other offices are located in Seattle, WA in the heart of Ballard.</p><p>To the candidate that meets our needs we will offer a very competitive salary, full health and dental, a 401k, paid Fridays off in June, July & August, relocation assistance and a once a year company retreat where we have a great time and talk about the next year of innovations that we are going to produce.</p><p><br><br>Please, no recruiters or contractors.</p></p><p><strong>Apply:</strong> Make sure you upload a cover letter, resume and a link to a portfolio (including interactive pieces). We will not be able to consider applications that do not have any work samples attached.</p>"},{"title":"LuxuryRealEstate.com: Intermediate Ruby Programmer","link":"http://authenticjobs.com/jobs/27475","pubDate":"Mon, 13 Jun 2016 11:48:41 CDT","description":"<p><strong>(Anywhere)</strong> <p>LuxuryRealEstate.com is looking for a motivated, up and coming Ruby developer with focus on open source technologies. We are a membership-based organization that markets global leaders in luxury real estate and the properties they represent. </p><p>We're maintaining a handful of web applications written in Ruby ranging from the public LuxuryRealEstate.com, an inquiry manager CRM, a custom report generator, a membership directory generator, a real estate listing manager to a RESTful API for maintaining our resources. We're excited to be entering a phase where we are moving to implementing new websites using front end technologies such as Node.js and Express.js on top of our own Ruby backed API. </p><p>Some of the challenges we face is to process daily real estate data imports from hundreds of brokerages around the world, and to weigh refactoring of legacy code versus implementing new features for our member brokerages. </p><p>As a key member of our Interactive Media team, you will play a central part in building the next generation of our online offerings for real estate brokers worldwide. You will also play a large part in refactoring our battle tested legacy code to conform to today's best practices. </p><p>Our toolkit include but isn't limited to Ruby, Rails, MySQL, Git, SASS, HAML, Solr, JavaScript, CoffeeScript, Redis, AWS and Heroku.</p><p>Required Skills<br>=============</p><p>* Have a year of Ruby experience<br>* Can read and write basic SQL<br>* Can read and write basic shell scripts (sh, bash)<br>* Have used a Redhat based distro (AWS, Red Hat, Centos, Fedora) on a daily basis<br>* An active Github account that shows diversity of interests.<br>* Know how to use basic GNU coreutils<br>* Basic MySQL administration skills</p><p>You report to the VP of Interactive Media. This is a full-time position either on site with our developer team in our office in downtown Seattle, a block away from the Pike Place Market, or a remote position from anywhere. LuxuryRealEstate.com is pleased to offer employee medical, dental, vision and life insurance, with ten paid holidays and three weeks vacation/sick time annually. A 401(k) plan is available.</p><p>Why Work With Us?<br>=================</p><p>* We are a financially stable family owned company who have been around marketing leading luxury brokers worldwide ever since Top Gun was the biggest grossing movie, Elvis Presley was inducted to the Rock'n Roll Hall of Fame, and. . . Lindsay Lohan was born.<br>* We're an agile company with quick decision making processes.<br>* We're conveniently located by Pike Place Market. <br>* We don't support IE 8 or older. ;) </p><p>This is a full-time position with great people and great benefits.</p></p><p><strong>Apply:</strong> </p>"},{"title":"Nelson Street: Freelance Tech Consultant (E-commerce, API integration) & Developer","link":"http://authenticjobs.com/jobs/27468","pubDate":"Sun, 12 Jun 2016 11:19:17 CDT","description":"<p><strong>(Anywhere)</strong> <p>Nelson Street is small web design studio mainly focusing on nonprofits. We're looking for a freelance, remote technology consultant & developer for a variety of projects.\n</p><p>We're looking for a technology consultant to help with the project discovery process, helping us understand the technical requirements. All our projects start with off-the-shelf CMS (mainly <strong>WordPress </strong>but also <strong>Craft CMS</strong> and <strong>Drupal</strong>). Many projects involve e-commerce or payment processing for donations, memberships, etc., along with one- or two-way sync with CRM systems, via APIs or by creating a script to export a CVS file. Some projects entail custom scripting, such as to extend an existing plugin. The consultant should be able to help conduct discovery discussions with our clients to help uncover requirements & options. The consultant may be involved in the actual development of these solutions if they're interested and the fit is right.\n</p><p>Ideal candidate has:\n</p><ul>\n <li>Back-end or full-stack development experience</li>\n <li>Experience with API integrations with systems such as CRMs</li>\n <li>Experience implementing e-commerce and a variety of payment processing options</li>\n <li>Experience with custom scripting to extend CMS or plug-in functionality</li>\n <li><strong>A demonstrated portfolio of work along with references</strong><strong> </strong></li>\n</ul><p>As mentioned, our most common platform is WordPress; we also love Craft CMS and sometimes work in Drupal. <strong>We are not opposed to considering another off-the-shelf CMS solution</strong>, as long as it has a robust plug-in library and large development community.\n</p><p>Finally, consultant must be U.S.-based and be:\n</p><ul>\n <li><strong>U.S.-based (no exceptions)</strong></li>\n <li>Available to join discovery discussions during U.S. business hours (no moonlighters)</li>\n <li>Responsible and dependable</li>\n</ul><p>Apply at <a href=\"mailto:whatsup@nelsonst.com\">whatsup@nelsonst.com</a> and include your hourly rate.\n</p></p><p><strong>Apply:</strong> </p>"},{"title":"ResponsiveAds, Inc.: VP, Product UI/UX Innovation","link":"http://authenticjobs.com/jobs/27466","pubDate":"Sat, 11 Jun 2016 18:39:42 CDT","description":"<p><strong>(Anywhere; Vancouver, BC; New York, New York)</strong> <p>In the world of the ad creative and the transition from Flash to HTML5,  ResponsiveAds has reimagined the creative process with its disruptive platform to produce engaging rich-media responsive experiences.   Not only has ResponsiveAds invented this genre, it is looking to expand its team with individuals passionate to redefine the future of advertising...\"consumers love\".</p><p>The ResponsiveAds business is a combination of the self-serve studio product (SaaS) as well as the full-service (managed service) rich-media responsive creative production offer.  This individual will get the chance to develop and play a significant role in the innovative production opportunities as well as leading studio product UI/UX development to be the best in the industry. </p><p>The position calls for an individual with a high degree of creativity and a deep ability in ad creative design and development.  He/she will need to have advanced skills in concepting, wireframing, product design, UI/UX,  web development, HTML5, javascript and animation to run all of the Responsive Ad innovation services and the advanced product roadmap.  This role will be a constant balancing act between the day-to-day of all of the rich-media production, templates, asset marketplace as well as development of the innovative features, UI/UX improvements to be incorporated into the self-serve studio product.</p><p>He/she  will be working on the overall product UI/UX, concept ideation & creative feature development as well as work in a small virtual start-up environment with the developers of the SaaS product and manage clients of ResponsiveAds for the full-service executions.</p><ul><li>A highly innovative award-winning attitude</li><li>A start-up mentality and a flexible approach to unpredictable complex situations</li><li>Self-Serve and SaaS product development and UI/UX design skills are critical</li><li>Front-End Responsive Web Design skills,  Sass workflow and integration</li><li>Extensive creative design experience with HTML5, CSS, Advanced Animation is a <em>must </em>requirement</li><li>Graphics design skills and mobile experience is a <em>must</em> requirement</li><li>Javascript experience a plus</li><li>Must be flexible to work with different virtual teams.</li><li>A good communicator with leadership and management skills</li><li>Ability to work closely with a virtual global team (slack, skype, google hangouts)</li><li>Passionate to get the best job done with a customer 1st attitude.</li></ul><p>The individual must be willing to go the extra mile in an environment where 24/7 availability is part of the process with a mind-set of customer first with very high-maintenance brand perfect clients.</p><p>We would like an individual based in Vancouver- Canada, New York- USA, Helsinki-Finland, so one of those locations is preferable, but not absolute.</p>\n<p>ResponsiveAds, Inc. (SPRINT-TECHSTARS 2016)  is the leading Responsive HTML5 advertising platform and service for the cross-screen Responsive Web.   Born out of the need for more engaging interactive, rich-media impact units that work with the increasing number of screen types and sizes, ResponsiveAds developed a platform to maximize creativity and allow designers to produce state-of-the art, fluid  banners that can be deployed via existing industry servers, exchanges and networks as a one-tag one-ad to fit all sizes.  Easily create pixel-perfect premium brand engagement campaigns from photoshop file or template that are responsive to screen, user and context. <a href=\"https://www.youtube.com/user/ResponsiveAds\">https://www.youtube.com/user/ResponsiveAds</a></p><p>Our customers include marquee names such as Dow Jones, Guardian, NPR, Mashable, Red Bull Media House, Tribune Publishing.</p>\n<p>Here are some examples:</p><ul><li>Billboard with embeddable widgets (Macy's) <a href=\"http://app.responsiveads.com/creatives/56f2d6a66eb025f25c00002a/preview\">http://app.responsiveads.com/creatives/56f2d6a66eb...</a></li><li>Billboard with video <a href=\"http://app.responsiveads.com/creatives/56f311388a5b00c95d00002f/preview/?format=56f311388a5b00c95d000031\">http://app.responsiveads.com/creatives/56f311388a5...</a></li><li>Billboard with Parallax ( scroll down the page) <a href=\"http://addemos.responsiveads.com/clients/redbull/honda/testpage.html\">http://addemos.responsiveads.com/clients/redbull/h...</a></li></ul></p><p><strong>Apply:</strong> </p>"},{"title":"Professional Themes: WordPress Theme Developer (PHP/JS/HTML/CSS)","link":"http://authenticjobs.com/jobs/27465","pubDate":"Sat, 11 Jun 2016 10:23:39 CDT","description":"<p><strong>(Anywhere)</strong> <p>We're a New York City-based web agency that develops online solutions for businesses. We assist our clients in building goal-oriented websites and ensure that they run smoothly and effectively. We’re passionate about design and development, and are driven by a genuine commitment to providing top-notch service and support.</p><p>Many of our product goals are centered around our relationship with <a href=\"https://automattic.com/\">Automattic</a>, the company responsible for creating WordPress.com. We currently sell premium themes on the platform and have a large backlog of theme designs that we're trying to finish developing and shipping out for both .com and WordPress.org customers. Given these aims, we're looking for someone who can, without heavy assistance, develop a fully functional, secure, performant, and top-notch WordPress theme from the design PSDs that we've already brainstormed and created. We also, when it comes up, develop custom themes within our digital agency wing of the company.</p><p>Our CTO (Philip Arthur Moore—you'll be directly reporting to him) is one of the original creators of <a href=\"http://underscores.me/\">_s</a>, the most prominent starter theme for WordPress, and your familiarity with _s, theming best practices, the WordPress Customizer, and GitHub is a must. Examples of themes you've fully built out and launched on WordPress.org or privately for clients will be required for viewing before an interview takes place; they will take place both through chat and a phone call. We believe that WordPress themes are as much about code as they are about the philosophy around the code, and understanding your philosophical approach to theme development is as important as the results that you deliver.</p><p>Front-end design skills, outside of an intimate understanding of CSS and emerging CSS practices, are not necessary. We're not looking for a designer but someone who's able to take someone's designs and beautifully translate them into a WordPress theme.</p><p>If this sounds like you or someone you know, please contact us. We're looking for a long-term relationship with someone who's dependable, who's a self-manager, who communicates early and often, and who holds herself feverishly accountable for meeting deadlines and promises. Familiarity with <a href=\"http://gruntjs.com/\">Grunt</a>, automation via <a href=\"https://travis-ci.org/\">Travis CI</a>/<a href=\"https://magnum-ci.com/\">Magnum CI</a>, <a href=\"https://github.com/Varying-Vagrant-Vagrants/VVV\">VVV</a>, the <a href=\"https://wordpress.org/plugins/vip-scanner/\">VIP Scanner</a> and <a href=\"https://github.com/Otto42/theme-check\">Theme Check</a> plugin, and <a href=\"https://github.com/professionalthemes/Subtitles\">Subtitles</a> are big plusses.</p><p>We're a 100% location-independent company and care not about where you are but whether or not you can deliver. Communication is our oxygen and without it nothing else matters. We rely on Basecamp and Slack for keeping all things afloat and operate primarily during NYC and Asia-based timezones.</p><p>Hiring timeline: applications will be accepted for two weeks; after that, our CTO will be in touch with every single applicant who applies to let her know whether or not she's been selected for an interview.</p><p>We look forward to hearing from you and hearing more about your work.</p></p><p><strong>Apply:</strong> </p>"},{"title":"GatherContent: Technical Director","link":"http://authenticjobs.com/jobs/27454","pubDate":"Thu, 09 Jun 2016 04:48:13 CDT","description":"<p><strong>(Anywhere inside the EU)</strong> <p>We’re looking for an experienced, EU-based Technical Director who wants to be part of a remote-working, fast growing startup (we’ve been around for a few years).</p><p>You’ll be working closely with the management team and the product team to deliver technically on the business vision.</p><h2>What we can offer you:</h2><ul class=\"list list--check\">\n  <li><strong>A VC-free, sustainable work environment</strong> - We're a long-term business with a long-term vision, hiring and spending within our means. Decisions are prioritised for our customers and our team, not shareholder return.</li>\n  <li><strong>A low headcount team</strong> - we think relationships are important and have a hard constraint to grow to no more than 50.</li>\n  <li><strong>Remote working</strong> – we offer the opportunity to work remotely within the EU. As long as you have a reliable internet connection, the choice and flexibility of location are yours.</li>\n  <li><strong>Family friendly</strong> – babies are welcome and the company is very family oriented.</li>\n  <li><strong>Work/life balance</strong> – we work a 35 hour week and encourage downtime. It’s about quality over time.</li>\n  <li><strong>The chance to make an impact on our business</strong> – As a small team (14) there’s a huge opportunity for everyone to contribute, collaborate and make their mark.</li>\n  <li><strong>Fun team</strong> – We love to socialise as a team. Even though we work remotely, the team get together in London every four months for awesome food and activities.</li>\n  <li><strong>Stock options and pensions</strong></li>\n</ul><h2>Challenges:</h2><ul class=\"list\">\n  <li>You'll be wearing many hats and switching rapidly between different projects, with the added layer of managing a remote team</li>\n  <li>Executing our ambitious integrations roadmap from a technical standpoint, within agreed budgets and timelines, whilst maintaining quality and adding huge value to customers</li>\n  <li>Prioritising ever-changing security and compliance needs of our worldwide customer-base</li>\n  <li>Constant give and take between business and technical needs, you will be a key voice in explaining decisions and priorities to the team</li>\n</ul><h2>What we're looking for in return:</h2><ul class=\"list\">\n  <li>Your undivided passion, energy, focus, and enthusiasm for the role, our product, and for our business</li>\n  <li>A self-starter attitude with experience managing and prioritising your own workload</li>\n  <li>An ability to get things done efficiently (whilst maintaining quality): working at a consistent pace</li>\n  <li>A team-player who works well with others and individually. We take a collaborative approach to problem solving across the entire business as well as in specific teams with a lot of pair programming and writing</li>\n  <li>Strong opinions, loosely held – no fear when it comes to inputting ideas and participating in discussions with the team. You must be happy to take critique, self-improve and move forward</li>\n  <li>Candour is a must - you will be confident giving constructive positive and negative feedback to other team members</li>\n  <li>An iterative approach – we focus on learning and improving our processes with an Agile approach to product development</li>\n  <li>You will be an amplifier of culture in our team- passionate about the business, our process, our values and best practice in your craft</li>\n  <li>Excellent communication- as a remote team this is a must: You can explain complex things simply, you are confident communicating with customers, by email or conference call, and you understand the importance of regular, concise communication with team members</li>\n  <li>Customer focus – You should always be thinking, “What can I be doing to deliver value to our customers?”</li>\n  <li>Leave your ego at the door. We’ve got a very collaborative and blame-free culture with a shared focus on what’s best for the company</li>\n</ul><h2>The skills we’re looking for are:</h2><p><strong>Past accountability for delivering technically on business vision and needs</strong></p><ul class=\"list\">\n  <li>4+ years experience working in a relevant technical management role</li>\n  <li>Working as part of the management team, leading and progressing our business from a technical point of view</li>\n  <li>Technical excellence - should be able to understand and challenge technical decisions made by the team</li>\n  <li>Experience with data-lead decision making and business intelligence software</li>\n  <li>Ability to multi-task, be adaptive, and deal with the variety of demands across our business. As a fast moving, small team, there will be multiple plates to spin</li>\n</ul><p><strong>Experience managing and growing a product team</strong></p><ul class=\"list\">\n  <li>Collaborating closely with the Product Director, Technical Lead, and the rest of the product team (there are 8 of us in total) in developing the product, our develpement process and stack</li>\n  <li>Hiring and shaping the team structure</li>\n  <li>Performance management, coaching and 121s</li>\n</ul><p><strong>Experience leading security and compliance best practices within an organisation</strong></p><ul class=\"list\">\n  <li>Passionate about driving a security culture across the company</li>\n  <li>Able to work with management team to ensure that we’re meeting security and compliance needs of our customers, including advising Customer Team on procurement questionnaires</li>\n  <li>Experience working closely with penetration testing agencies</li>\n  <li>A 'pragmatic’ approach to prioritising appropriate levels of security and compliance for the stage of our business and the resources at our disposal</li>\n</ul><p><strong>Integrations strategy</strong></p><ul class=\"list\">\n  <li>Working closely with our Commercial Director on our integrations strategy</li>\n  <li>Responsibility for managing the technical relationships with GatherContent’s integration partners</li>\n</ul><p><strong>Our stack</strong></p><ul class=\"list\">\n  <li>AWS infrastructure (EC2, CloudFront, RDS, et. al.) using Ubuntu 14.04 LTS, nginx, Aurora and PHP 5.5/7.0</li>\n  <li>PHP 5.5, PHP 7.0 and ES2016</li>\n  <li>CodeIgniter, Laravel, ReactJS</li>\n  <li>REST API Interface</li>\n  <li>Layered Architecture, Hexagonal (Ports and Adapters) and CQRS</li>\n  <li>Active Record and Data Mapping</li>\n  <li>Test-Driven Development, Behaviour-Driven Development, Domain-Driven Design</li>\n</ul><h2>Bonus points for experience with:</h2><ul class=\"list\">\n  <li>Working remotely</li>\n  <li>Working in a startup environment</li>\n  <li>Agile development principles</li>\n  <li>Experience working with an OKR framework</li>\n  <li>Knowledge of R&D tax credit claims</li>\n</ul><h2>Finer details:</h2><ul class=\"list\">\n  <li>Start date: as soon as possible</li>\n  <li>Pay: dependent on what you can bring to the table</li>\n  <li>Full-time role</li>\n  <li>Based anywhere in EU. Remote or on-site (we have an office in London)</li>\n</ul><p>Please be aware that although the position is remote, we will need you to travel to London during the interview process and travel within the EU for a team day every four months, if you’re successful.</p><p>If you think you sound like a good fit, please read the application steps below carefully.</p><h2>How to apply</h2><p>Please send us a cover letter with answers to the following questions;</p><ol class=\"list list--ordered\">\n  <li>Why do you want to work at GatherContent?</li>\n  <li>Can you tell us about a time when you had to give someone in your team negative feedback?</li>\n  <li>Can you tell us about a time when there was a conflict between business and technical priorities? What did you do?</li>\n  <li>Can you give us a brief description of your background (NOT a resume or CV)?</li>\n</ol><p>Also, please include the word ‘apricot’ in your cover letter to show that you’ve read the job role (it helps us weed out time wasters!)</p><p>We look forward to seeing your application.</p><p><a href=\"mailto:jobs@gathercontent.com?subject=Technical%20Director%20Job%20Role\">Apply now</a> via email.</p><h2>What happens next?</h2><p>This job advert will be displayed for 30 days (until the 12th of June). After 30 days we review all of the applications, screen for technical ability, attention to detail and general suitability.</p><p>Applicants who are successful will go through a Skype cultural interview. Then, the next round involves a Skype technical/skills interview. Applicants who get through these stages attend a 1 day team day in London where they will meet the team for some further discussion and lunch. Travel and expenses will be covered.</p><p>Shortlisted applicants who get through the team day are given a paid for homework ‘assignment’ which forms part of our agile sprint. We are happy to fit this in around your schedule if you currently have a job.</p><p>We will then be in touch very soon to let you know if you are successful</p><h2>About us</h2><p>We're a tightly knit and passionate team. We work with a diverse range of organisations around the world to improve their content production processes.</p><p>GatherContent is a SaaS platform which solves the fundamental problems associated with digital content production. The platform enhances content development workflow, content formatting, and publishing - saving our customers time and money.</p><p>We launched in 2012 and bootstrapped our way to profitability before closing seed funding in February 2014.</p><p>GatherContent is used by customers all over the world including Ogilvy, JWT, Spotify and Harvard University.</p><p>Our office is just off Brick Lane in East London but the team are remote around the UK, Germany and Spain.</p></p><p><strong>Apply:</strong> </p>"},{"title":"Clevertech: Dedicated Tech Lead","link":"http://authenticjobs.com/jobs/27453","pubDate":"Wed, 08 Jun 2016 18:37:23 CDT","description":"<p><strong>(New York City)</strong> <p><strong></strong><strong>About You</strong></p><p>You've moved beyond MVPs and still respect the lean methodology. </p><p>You know the value of integration testing, feature flags, and logging.</p><p>Bill Jordan's Medium article (https://goo.gl/x56g6y) speaks to you.  And perhaps you have a few more rules to add to it.</p><p>You set the mood on the team. </p><p>You know how to lead a team around building and extend a successful product that has found market fit.</p><p>You are experienced with full stack Javascript, but perhaps you prefer koa to express. Mongo is great, but Postgres is better when the situation calls for it. And you know when the situation calls for it. New tools are great, and sometimes old tools are better. New tools you like might include Electron, React+Redux, Knex, or AWS Lambda. </p><p>You have experience with product roadmaps, setting expectations, and achieving deliverables. But you still code a majority of the time.</p><p>You live anywhere.</p><p><strong>About Clevertech</strong></p><p>We believe that freedom, mastery and purpose fuel motivation. Freedom as remote work. Mastery as dedicated to one project and that project is a world class project that will stretch you and Purpose in the form of changing the world through software. </p><p>We also believe that the best team are filled of people who are humble, hungry and smart with people. </p><p>We are professional and we move quickly.</p><p>You might have seen us around - we are growing and have been growing for some time. And that is due to the team of world class developers that are creating client satisfaction. If this sounds like something you want to be a part of, come join our team of over 100 developers.</p><p>Who are they? They’ve rejected offers from top companies. They are travelers who enjoy skiing in the morning and coding in the afternoon, aspiring entrepreneurs who want a tour of duty to learn how the pros do it, they are parents of young kids that want to work from home so they don't waste their commute missing their kids growing us. Here’s what they have in common: </p><p>They want to be the best they can. They’re all invested in becoming better together and we support their constant learning. </p><p>For more about us, check out why.clevertech.biz</p></p><p><strong>Apply:</strong> </p>"},{"title":"You Need A Budget (YNAB): Confidently Humble UI/UX Designer","link":"http://authenticjobs.com/jobs/27452","pubDate":"Wed, 08 Jun 2016 16:55:25 CDT","description":"<p><strong>(Anywhere)</strong> <p>YNAB is a growing software ecosystem that include apps for web, iPhone, iPad, Apple Watch, and Android phones, and if you’re the one we’re looking for you have strong experience in designing for most of those (at least three years). You’re a designer who views your job as that of problem solver. You come to the table not only with a knack for interaction design and love of logical UI patterns, but also with a deep empathy for people. We design our software to fit our users more than our fancy, and you love nothing more than digging through (or conducting!) research that leads the way in the design process. You’ve been around the block a few times (and have the portfolio to prove it), and know what it means to design a mature, evolving product.</p><p><strong>Requirements (these are real, actual requirements):</strong></p><ul><li>You must have at least 3 years of experience working in product design <strong>at a software company.</strong> Complex or data-rich applications are a plus.</li><li>Experience in designing applications for both web and mobile (in your cover letter, please include the platforms for which you have designed and your level of experience with them).</li><li>We are looking for a designer who has a strong background in UX and usability but who also can design UI independently. This is a truly mixed position where you will be responsible for activities traditionally held in the “UX” and “UI” wheelhouses.</li></ul><p>That’s a super-brief intro of what you’ll be working on. But first, you need to know if you’ll even like working with us. We think you will.</p><h1><strong>A Bit About Us</strong></h1><p>We build the best budgeting software around, YNAB or “You Need a Budget” if you have a lot of extra time on your hands. For more than a decade, people have been buying YNAB and then telling their friends what a difference it has made in their lives. (<a href=\"https://www.google.com/search?q=ynab\">Google us</a>, or read some of our reviews on the app store, and you’ll see what we mean.) We love building something that has a huge positive impact on people’s lives.</p><p>We’re profitable, bootstrapped, and growing. YNAB started in 2004 and we haven’t taken any outside funding—we’re in it for the long haul.</p><p>We have one overarching requirement when it comes to joining our team: our<a href=\"https://docs.google.com/document/d/16hufsixsrv1j2jZkWUgQmeKpNfQRsacnnK2xTVwO0ew/edit?usp=sharing\"> Cultural Manifesto</a> has to really <em>click</em> with you. If you’re nodding emphatically while reading it, you’ll probably fit right in, in which case, we can’t wait to hear from you!</p><p>First, let’s talk about life at YNAB and then we’ll go into detail about what we’re looking for.</p><h2><strong>How You’ll Work at YNAB</strong></h2><p>We work really hard to make working at YNAB an amazing experience. We have a team full of truly exceptional people—the kind you’ll be excited to work with. Here’s how we operate:</p><h3><strong>Live Where You Want</strong></h3><p>We’re a distributed team, so you can live and work wherever you want. Proximity doesn’t influence productivity. As I write this, Taylor (our CTO) is in, London or Brazil, or maybe back in Austin? Not all of us travel so extensively, but the fact that he does is totally okay because we’re all adults. Just make sure you have a reliable internet connection.</p><h3><strong>No Crazy Hours</strong></h3><p>We rarely work more than 40 hours per week. There have been a few occasions where things got a little crazy and people had to log some extra hours. But then they took some extra time off, so it all balances out. We work hard and smart but we’re in this for the long haul, no need to go crazy on the hours.</p><h3><strong>Take Vacation (Seriously)</strong></h3><p>We want you to take vacation. In fact, we have a <em>minimum</em> vacation policy of three weeks per year (plus two extra weeks for Christmas break). It’s important to get out and do something. We’ll look forward to seeing pictures of your vacation in our internal chat room, creatively named #office_wall.</p><h3><strong>The YNAB Meetup</strong></h3><p>We get the teams together once a year to catch up on spreadsheets and powerpoints in a Best Western conference room. Just kidding.  This year it was a gigantic cabin in the mountains. The time before that<a href=\"https://vimeo.com/youneedabudget/review/120084054/93e11d6343\"> it was in Costa Rica</a>. We do really fun things, but the highlight always seems to be just hanging out together and having a blast.</p><h3><strong>Up Your Game</strong></h3><p>We’re serious about helping you improve your craft. We budget for it (hey-o!).. Think conferences, Lynda subscriptions, dedicated time away from work to learn something new... it’s really up to you and your manager. But we love to see our people growing.  </p><h3><strong>International is Absolutely Okay</strong></h3><p>If you are Stateside, we’ll set you up as a W2 employee. If you’re international, you’ll be set up as a contractor. Employee or contractor, it’s all the same to us. You’re part of the team. (We are spread all over the world: Switzerland, Pakistan, Scotland, Canada, and all over the United States.)</p><h3><strong>If You’re Stateside…</strong></h3><p>YNAB offers fantastic health, dental, and vision insurance, where we cover 100% of the premium for you <em>and your family.</em> (No need to check your vision, you read that right, 100%. Although if you did need to check your vision, NBD, we’ve got you covered!)</p><p>We also have a Traditional and Roth 401k option. YNAB contributes three percent whether you choose to throw any money in there or not. It vests immediately. (Are you a personal finance junkie like Jesse? He set up YNAB’s 401k to have the lowest fee structure possible, where all plan costs are paid by YNAB, not <em>your retirement</em> <em>nest egg</em>. The investment funds available are fantastic, passively-managed, ultra low-cost index funds. You’re not a PF junkie? Why then, did you muddle through all of that awesomeness?)</p><h3><strong>Other Tidbits</strong></h3><ul><li>Once you start, we DEMAND (in a friendly, ALL CAPS IS YELLING way) that you fill out your “Bucket List” spreadsheet with 50 items. (That’s harder than it sounds!) YNAB then helps you knock off a significant item every few years.</li><li>The bucket list also really helps in deciding what we should give you for your birthday and Christmas: No gift cards here. We tried that. Super boring.</li><li>We have a bonus plan based on profitability. You’ll be in on that from day one. YNAB wins, you win. That kind of thing.</li><li>We’re all adults. There’s no need to punch a clock, or ask for permission to take off early one afternoon to go see the doctor (health insurance premium 100% covered!). We look at what you’re accomplishing, not how long you sit (have you tried <em>standing</em>?) in front of a computer.</li><li>We want you firing on all cylinders so we’ll set you up with a shiny new computer and replace it every three years.</li><li>Did I mention we make a huge, positive difference in people’s lives? You may not <em>think</em> that matters much, but then a few months down the road you’ll realize it’s made your job really, really enjoyable. Don’t underestimate this one!</li></ul><p>If this sounds like your ideal environment, read on because now I want to talk about you.You will play a big, big part in helping YNAB customers do more from their phones without being tied to a computer. You will change lives. I’ll only say that six more times.</p><h1><strong>Now, back to you, our new UI/UX Designer...</strong></h1><h2><strong>What Success Looks Like:</strong></h2><p>You’ll be working alongside our sole product designer as we evolve our web application and build out applications for mobile. We’re calling this year The Year of Mobile. We’ll call it an unadulterated success when you quickly get a grip on the design of our current product ecosystem, hit the ground running on new features, and are key in delivering a top-notch, feature-rich experience to YNABers on mobile before the end of 2016. Contributing to that success, you’ll also deliver several key features for the web app before the end of the year.</p><p>You’ll need to:</p><ul><li>Learn the design logic and UI patterns of our apps like the back of your hand: you have no problem designing a feature for the web while mapping out its manifestation on iPhone and Android. You can clearly discern and navigate the relationship between the UI and the data-driven logic behind the scenes. That said, you aren’t afraid of doing math in the course of your design work.</li><li>Solve design problems in a user-centric feedback loop. You’ll need to break down analytics and user feedback to make sound design decisions, and will follow up on the data gathered after the feature is released. You continue to iterate and improve your designs until the data confirms success.</li><li>Deliver meticulously organized and thorough design flows that cover UI styling, user flow, and any design logic impact on other parts of the system. Update and maintain this documentation as the apps evolve.</li><li>You are a fully digital designer and embrace our process of perfecting designs in the browser or on the device they are intended for. You will provide clear and concise instruction to the developer you are working with during this process, basic knowledge of HTML and CSS is a plus.</li><li>We use illustrator for the vast majority of design work and maintain a growing set of style guides for use across our apps. You will aide in the creation and maintenance of the guides and feel comfortable contributing new UI for our applications and website.</li><li>Shepherd your work from inception to development. You will present your work in review meetings with fellow designers and stakeholders, make agreed upon edits and follow ups, and will brief developers on the upcoming feature. Design reviews in development include both form and function and you will see the feature through until the end.</li></ul><p>Finally, the success of a designer at YNAB hinges upon the ability to approach design as holistic problem solving for both user and business goals. We work collaboratively here and you’ll listen to ideas, questions, and critiques from teammates with grace and patience. That said, you know your stuff and can eloquently and logically explain design decisions. You see this type of exchange as critical to the success of yourself and our product: it is through sharing ideas and being open to the brilliance of others that we arrive at the best solutions.</p><h3><strong>Bonus Points:</strong></h3><ul><li>You already use and love YNAB.</li><li>You have one or more of the following skills: Research, Graphic design, interactive prototyping, or motion graphics.</li></ul><p>Salary will be between $85k and $102k, depending on experience.</p><p>Apply through the button below (<strong>be sure to follow instructions on that page</strong>) by 11:59PM on June 24th, 2016. Firm. It’s a real deadline. </p><p><strong>*Update:</strong> We have now passed the application deadline and are no longer accepting applications. If you didn't get in on time for this one, we hope to hear from you for one of our next positions down the road. </p></p><p><strong>Job Perks:</strong> -Great health insurance plan (medical, dental, & vision)\n-We pay for 100% of the insurance premium for you AND your family\n-401k, with 3% automatic contribution\n-Amazing team culture\n-Live where you want (we're all 100% remote)\n-Minimum vacation policy\n-Profit-based bonus\n-Christmas & birthday gifts\n-Change people's lives (</p><p><strong>Apply:</strong> </p>"},{"title":"Atomi: Senior Front-End Developer (React)","link":"http://authenticjobs.com/jobs/27433","pubDate":"Mon, 06 Jun 2016 22:28:14 CDT","description":"<p><strong>(Sydney Australia, Anywhere)</strong> <p>At Atomi we make awesome online video courses for students. With over 50k students and teachers now using our lessons, we've been growing quick. </p><p>As a couple of major projects collide, our front end team needs a little back up to keep up the pace. </p><p><strong>The Project:</strong></p><p>As part of our re-brand we're refreshing our pre-login website.  Our design team is pumping out some great looking stuff, so we're on the hunt for a quality engineer that can use modern tooling to bring it to life quickly and neatly. Project should be 6-8 weeks with the opportunity to continue if we think we think you're a keeper.</p><ul><li>We'll provide you with some awesome designs and assets in Zeplin to make life easy.</li><li>Although you'll be largely autonomous, you'll work with our design team to stage the project, set deliverables, ask questions and get regular feedback.</li><li>You'll use git and operate on your own feature branch and commit regularly.</li><li>You'll submit pull requests and work with QA to squash any bugs.</li></ul><p><strong>About You:</strong></p><ul><li>You're more than comfortable with modern tooling such as CSS3, HTML5, jQuery,  SaSS, Gulp/Grunt and React.</li><li>You can point us to quality projects you've been involved with and explain the contributions, decisions and compromises you made.</li><li>You write clean, neat code with maximum use of reusable components. </li><li>You have well justified opinions on front end frameworks and design patterns.</li><li>You're worked with modern CI/agile practices before.</li><li>You like getting sh*t done, shipping fast and iterating.</li></ul><p><strong>Nice to haves:</strong></p><ul><li>You're super easy to work with.</li><li>You have an eye for design, you're a stickler for alignment and you're just that little bit OCD about shipping sexy products.</li><li>You've got some quality banter.</li></ul></p><p><strong>Apply:</strong> </p>"},{"title":"X-Team International Pty Ltd: Android Developer","link":"http://authenticjobs.com/jobs/27432","pubDate":"Mon, 06 Jun 2016 19:19:07 CDT","description":"<p><strong>(Anywhere)</strong> <p>About X-Team</p><p>“Developers you can trust, whenever you need them.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are people who believe that #sleepcanwait when it comes to being there for others, that we all have the opportunity to unleash our inner superhero and effect change in the world.</p><p>About You</p><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p>Most important:</p><p>- 3+ years of experience working in Android development<br>- Experience with Android Unit Testing <br>- Experience with JSON, XML, SOAP, REST<br>- Experience with server side technologies (Java, NodeJS, PHP)<br>- Experience with Google APIs is a plus<br>- Experience storing and indexing data <br>- Code optimization and performance improvements<br>- Write well designed, testable, efficient code</p><p>Nice to have:</p><p>- Experience with working remotely<br>- Familiar/involved with open­ source projects</p><p>Personal:</p><p>- Independent<br>- Fluent in English, written and spoken<br>- Problem solver<br>- Proactive attitude</p><p>Benefits:</p><p>- Get the chance to work with big brands<br>- Work remotely and live freely<br>- We’ll help you learn and grow each day<br>- Unleash your inner superhero</p></p><p><strong>Apply:</strong> </p>"},{"title":"X-Team International Pty Ltd: iOS Developer","link":"http://authenticjobs.com/jobs/27431","pubDate":"Mon, 06 Jun 2016 19:19:07 CDT","description":"<p><strong>(Anywhere)</strong> <p>About X-Team</p><p>“Developers you can trust, whenever you need them.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are people who believe that #sleepcanwait when it comes to being there for others, that we all have the opportunity to unleash our inner superhero and effect change in the world.</p><p>About You</p><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p>Most important:</p><p>- 3+ years of experience in mobile iOS Development.<br>- Experience with Objective-C, CSS, Javascript, HTML<br>- Experience with JSON, XML, SOAP, REST<br>- Experience with server side technologies (Java, NodeJS, PHP)<br>- Experience storing and indexing data<br>- Knowledge of Swift and Xcode a plus<br>- Code optimization and performance improvements<br>- Write well designed, testable, efficient code</p><p>Nice to have:</p><p>- Experience with working remotely<br>- Familiar/involved with open­ source projects</p><p>Personal:</p><p>- Independent<br>- Fluent in English, written and spoken<br>- Problem solver<br>- Proactive attitude</p><p>Benefits:</p><p>- Get the chance to work with big brands<br>- Work remotely and live freely<br>- We’ll help you learn and grow each day<br>- Unleash your inner superhero</p></p><p><strong>Apply:</strong> </p>"},{"title":"The Institutes: Freelance Video Animator","link":"http://authenticjobs.com/jobs/27423","pubDate":"Mon, 06 Jun 2016 10:52:57 CDT","description":"<p><strong>(Anywhere)</strong> <p>The Institutes, a not-for-profit organization, is the leading provider \nof risk management and property casualty insurance education for more \nthan 100 years. The Institutes are committed to developing innovative \nprofessional development and knowledge solutions for insurance \nprofessionals worldwide.<br></p><p>The Institutes is seeking a freelance video animator to support our in-house design team with the production of educational videos.  The candidate will receive creative direction and all graphical and audio assets needed to produce a series of 1-3 minute animated videos that will be used as supplemental learning materials for online courses. Working closely with our design team, you will bring the prepared storyboards to life in AfterEffects and be responsible for file-prep, animation, editing, and post-production work. Must have great communication skills, be able to work effectively with internal teams to follow creative direction. Fluency and access to Adobe Suite (AfterEffects, Illustrator, Photoshop), and post-production software (Final Cut Pro) are required. </p>    </p><p><strong>Apply:</strong> </p>"},{"title":"Deevoted: Contract Sales Consultant/Digital Marketing","link":"http://authenticjobs.com/jobs/27404","pubDate":"Thu, 02 Jun 2016 13:08:58 CDT","description":"<p><strong>(Schenectady, NY/Anywhere)</strong> <p><strong></strong><strong>Deevoted, (www.deevoted.com)</strong>, a leading provider of Internet marketing solutions for small- and mid-sized companies, has a unique opportunity for a savvy sales professional to represent us. </p><p>Here’s why you’ll love working with Deevoted:</p><p><strong>Experience and Expertise:</strong></p><ul><li>An award-winning design and development firm with a 5+ year history and a client portfolio that includes established brands in healthcare, education, professional services, industrial manufacturing, sports and more</li><li>Strong customer loyalty /year-over-year high renewal rates</li></ul><p><strong>What You Can Expect From Us:</strong></p><ul><li>Our dedicated support and coaching for your continued success </li><li>“Team selling approach,” with strategists, developers and other team members assisting in new business development  </li><li>Strong company sales collateral, presentations and technologies</li><li>Established territory, account and prospect assignments </li><li>Performance recognition, commissions and bonus potential for high achievement</li></ul><p><strong>What This Means For You:</strong></p><ul><li>Uncapped earnings potential</li><li>High commission payouts, plus opportunity for quarterly/annual additional bonus offerings</li><li>Independent contractor status, working from your home office</li><li>Your confidence in the fulfillment, performance and recognized value of the programs that you sell</li></ul><p><strong>Desired Skills and Experience:</strong></p><ul><li>Minimum 2 years proven sales experience preferred</li><li>Drive to succeed in a high commission environment as an independent contractor</li><li>A working knowledge of the web and internet marketing  </li><li>Experience with HubSpot a plus</li><li>Solid time management and organizational skills</li><li>Able to build rapport with a variety of personality types</li><li>Experience with Excel, Word and PowerPoint</li></ul><br>If you want to take the next step toward a career with an established company in a fast growing field, please send us your resume.</p><p><strong>Apply:</strong> </p>"},{"title":"PRI: Digital Content Producer","link":"http://authenticjobs.com/jobs/27401","pubDate":"Thu, 02 Jun 2016 10:08:13 CDT","description":"<p><strong>(Anywhere)</strong> <p>PRI is seeking an experienced, highly-skilled Digital Content Producer to develop content for one of its key clients Mutts.  The position is full time contract to full time hire within   six months at which time company benefits will be available (health insurance, 401k, paid holidays and PTO).</p><p>This individual will manage the digital development and marketing process (planning, scheduling, writing, re-purposing, proofing, and promoting content). The digital content producer will play a key role in helping to execute and maintaining the digital brand and strategy of the organization. We need a team player who’s excited to jump right into a team of five people.</p><p>MUTTS is a brand with followers so loyal they tattoo us on their skin—literally! Drawn by award-winning cartoonist Patrick McDonnell, the MUTTS comic strip appears in over 700 newspapers in 20 countries. MUTTS has been described by Peanuts creator Charles Schulz as “One of the best comic strips of all time.”</p><p>MUTTS.com and the MUTTS social media presence let readers interact with the brand and their favorite characters Mooch and Earl. And they do so passionately! Our social media continues to grow by leaps and bounds, with impressive reach and engagement. We’re looking for an energetic, fun-loving, experienced Digital Content Producer to join our team and develop content for our digital channels—ranging from website to social media and marketing emails. Yesh!</p><p>Responsibilities</p><ul><li>Maintain the MUTTS brand—with consistent voice and tone—across all communications</li><li>Write copy for blog posts, for social media, email, web, and other digital channels</li><li>Propose/manage/execute social media, digital, and email campaigns; tailor content as needed for individual products, audiences, and channels</li><li>Propose effective, measurable social media strategies, ideas, content to advance growth of audience</li><li>Track, test, measure content (including email marketing) to determine success</li><li>Research, advise, and execute best practices for planning, writing, and disseminating digital content; and for engaging audiences online</li><li>Proof and copy-edit digital content</li><li>Develop KPIs and success goals across content streams and digital channels</li><li>Create, and maintain, a system for tracking influencers across each platform and social media channel.</li><li>Create, and maintain an editorial calendar and managing content written originally and acquired through crowd sourcing</li><li>Help create analytics reports for varying staff/purposes as needed</li><li>Send organizational marketing emails via Hubspot email marketing software</li><li>Inject joy into all writing and posts, engage with followers using the light-hearted humor of MUTTS</li></ul><p><br>Requirements</p><ul><li>A minimum of two to four years of experience with social media, email, and marketing strategy; traditional writing and analysis, preferably on policy issues; and analytics</li><li>Expert-level knowledge of social media channels, their use, and best practices (including SEO)</li><li>Demonstrated experience in creating, planning, executing digital campaigns</li><li>Demonstrated high proficiency in writing compelling, digestible copy on complex issues without diluting the integrity of the source material</li><li>Ability to write engaging headlines and micro-content (summaries, descriptions, etc) </li><li>Exceptional attention to detail and the ability to copy edit</li><li>Exemplary project management and calendaring skills</li><li>Working knowledge of Google analytics, Hootsuite, and Buffer and experience using social media monitoring software such as Attentive.ly</li><li>Basic knowledge of HTML/CSS</li><li>Working technical knowledge of email marketing software such as Hubspot preferred.</li><li>Bachelor's degree or equivalent experience in Digital Communications and Media, or related degree/equivalent experience</li><li>Strong visual design/graphics experience such as Photoshop a plus</li><li>Personal interest in issues relating to pet rescue, healthy-living, vegan/vegetarian lifestyle a plus</li></ul></p><p><strong>Apply:</strong> </p>"},{"title":"Spartan Systems: Experienced UI/UX Designer","link":"http://authenticjobs.com/jobs/27360","pubDate":"Tue, 24 May 2016 11:52:53 CDT","description":"<p><strong>(Anywhere)</strong> <p><strong>What We’re Looking For</strong></p><p>A passionate, experienced UI/UX Designer to take part in the ruckus going on at Spartan. We want a designer who is an excellent communicator and team player, who understands users, who can think differently and solve problems creatively. We’re after someone who values bettering themselves and their team, is passionate about continually learning new technologies, and who cares deeply about the quality of interfaces and experiences they bring to life.</p><p>Our UI/UX designers are confident, multi-talented folks who take pride in their craft and live for continuous improvement. They are accomplished at sketches, conception, developing user flows, creating wireframes, delivering prototypes, and designing aesthetically pleasing interfaces. In addition, they bring their creations to life by engineering performant, modularized front-end frameworks.</p><p>If you can produce beautifully designed webs and apps with an emphasis on delighting users then maybe you're who we're looking for. If you can solve problems, simplify complicated ideas, communicate effectively, and deal with stakeholders and developers alike—then please—drop us a line.</p><p><strong>We Fully Embrace Working Remotely</strong><br>We offer a remote-friendly work environment if relocating to beautiful Chattanooga isn’t appealing to you. We believe a great team shouldn’t be restricted by geography, however, we do require our employees to located within the U.S. and be constantly available during our working hours - 9am to 5pm Eastern time.</p><p><strong>Tools Our UI/UX Designers Are Currently Using</strong><br>While this is what we’re currently using on our day-to-day projects, we’re always exploring new technologies to add to our toolbox so we can pick the best tool for a given job.</p><ul><li>Sketch</li><li>Invision</li><li>Sketch Pad / Assorted Graphite Sketch Pencils</li><li>SASS / SCSS / Bourbon / Bitters / Neat</li><li>Git / Github</li></ul><p><strong>What Our UI/UX Designers Value</strong><strong><br></strong>Every design professional has strengths and weaknesses, but these are values we live by every day at Spartan.</p><ul><li>Designing in the browser vs. mocking up every view in Sketch.</li><li>Creating solutions based off real end-user needs vs. forcing design opinions</li><li>Responsive design working seamlessly across all current platforms</li><li>Creative ideas with a problem solving mindset</li><li>Open to receiving objective criticism and improving upon it</li><li>Collaborating with fellow designers, engineers, and stakeholders to ensure success as a team</li></ul><p><strong>Requirements</strong></p><ul><li>Three or more years experience of a proven track record</li><li>Exceptional UI skills, production value and attention to detail</li><li>Strong portfolio with samples of every stage of design - lo-fi to hi-fi</li><li>Samples of user testing and customer discovery to achieve your design</li><li>Excellent communication, documentation, and organization skills</li><li>Branding and messaging experience a plus</li></ul><p><strong>About Spartan</strong><strong><br></strong>Spartan is located in Chattanooga, TN—<a href=\"http://www.inc.com/jessica-stillman/what-s-going-on-in-chattanooga.html\">recently featured in Inc. Magazine</a> as a technology magnet, due in part to our city-wide 10 gigabit fiber network. You read right, we have super fast, super cheap internets. Chattanooga is also an <a href=\"http://www.outsideonline.com/adventure-travel/best-towns/Sweet-HomeChattanooga.html\">outdoor mecca</a> surrounded by mountains and bisected by the Tennessee River. Add to the list a ton of local restaurants, microbreweries, coffee houses, music venues, low cost of living and a walkable metro area with beautiful views and you have a fantastic quality of life.</p><p>Are you ready to work with a talented team of passionate designers and engineers in an up-and-coming, <a href=\"http://www.holacracy.org/\">self-governed</a> company located in the middle of a perfect city? Let’s make awesome together.</p><p>Full time team members at Spartan Systems have access to the following benefits:</p><ol><li>Health/Dental/Vision</li><li>Life Insurance</li><li>Unlimited Personal Days</li><li>Company funded continuing education resources</li></ol><p><strong>How To Apply</strong></p><p>This is a full time employment opportunity for a single individual. We’re not looking for contractors, part-time individuals, or agencies of any kind. Applicants must be located in the contiguous United States. Thanks!</p><p>To apply, please fill out our application here: </p><p><a href=\"https://spartanhr.bamboohr.com/jobs/view.php?id=3\">https://spartanhr.bamboohr.com/jobs/view.php?id=3</a><br></p></p><p><strong>Apply:</strong> </p>"},{"title":"EllisLab: Software Engineer","link":"http://authenticjobs.com/jobs/27359","pubDate":"Tue, 24 May 2016 10:02:55 CDT","description":"<p><strong>(Anywhere)</strong> <p>EllisLab makes ExpressionEngine, a premier content management system that impacts millions of people everyday. We are a small company that loves improving the lives of web professionals. We are looking for an exceptional developer who enjoys making and using things on the web. Is it you?\n</p><p>You are self-motivated and self-directed and you don’t need to have your hand held. You have a broad skill set that lets you contribute with experts in a variety of areas. But you have one strength with deep expert knowledge.\n</p><p>You love challenges, including having solved uninteresting problems because they were the right thing to do. You have a history of following your effort, and a reputation for reliability. This attitude shows in your daily life, not just your code.\n</p><p>We are committed to diversity and especially encourage members of underrepresented communities to apply. We have no central office, and required travel is infrequent. We believe that careers support your family and personal goals, not the other way around. We all work from home, using Zoom for meetings, which are few (we don't have daily standups). We are flexible with when and where we do our work. We try to inspire each other and are a tight-knit team that loves figuring out how to solve our customer's problems. We work hard to focus only on doing things that help a cottage developer <a href=\"https://ellislab.com/manifesto\" target=\"_blank\">stand toe to toe with Goliath</a>.\n</p><h1>Requirements:</h1><ul>\n <li>Proficient with PHP, MySQL, and JavaScript</li>\n <li>Self-organized</li>\n <li>Excellent written and verbal communication</li>\n <li>Comfortable with git</li>\n <li>Solid understanding of web site security and risk mitigation.</li>\n <li>Comfortable with Object Oriented Programming (OOP).</li>\n <li>Strong computer science fundamentals, including common design patterns.</li>\n <li>Familiar with all sorts of CMSs, publishing tools, and frameworks</li>\n <li>Legally able to work in the United States</li>\n</ul><h1>Extraordinary, but Optional:</h1><ul>\n <li>Have written an ExpressionEngine Add-on</li>\n <li>Know 10+ things that should be improved in ExpressionEngine right now.</li>\n <li>Proficient in other programming languages besides PHP and JavaScript</li>\n <li>Have shipped a product of any kind that required consistent, long-term follow through</li>\n</ul><p>We do not hire independent contractors. All team members are full, bona fide employees with the benefits and legal protections that provides.\n</p></p><p><strong>Job Perks:</strong> EllisLab provides flexible hours, health benefits, 401k, vacation time, and a computer stipend.</p><p><strong>Apply:</strong> To apply write a few words about why you want to work for EllisLab. Please include two code samples. The first should be work you are not proud of. The second, that you are exceptionally proud of. For each, provide a short explanation of why you chose to include it. Additionally, let us know what you consider your deep strength. Your email is an example of the communication you’ll provide every single day, so make it great.</p>"},{"title":"Acxiom: Web Developer","link":"http://authenticjobs.com/jobs/27349","pubDate":"Fri, 20 May 2016 12:53:39 CDT","description":"<p><strong>(Chicago, Austin, San Francisco, NYC, Anywhere in the U.S.A.)</strong> <p>This is an up and coming high demand role within Acxiom’s growing business that builds some of the most sophisticated and individually relevant web sites for Fortune 100 companies.  The Web Developer role demands someone with a passion for technical challenges and a fast-paced environment.  If you’re equally comfortable working on code as you are conveying technical information to non-technical team members and clients, we should talk.</p><p><br>Job Description</p><p>In this role, you will provide support and leadership during the requirements collection process, write test and deliver code to meet those requirements and then provide additional support during testing and vulnerability assessment phases of the project.  The role is a pivotal position within the business combining an ability to manage technical challenges while meeting project timeline commitments.</p><p><strong>Primary Responsibilities</strong>  </p><ul><li>Write and maintain code for web applications in SiteCore<ul><li>HTML, CSS, JavaScript</li><li>Visual Studio – C# (MVC and Web Forms)</li><li>SOAP Web Services</li></ul></li><li>Interface with internal and external web services</li><li>Interface with internal and external web services</li><li>Submit quality code to source control</li><li>Interact daily with internal project managers and development team members</li><li>Interact frequently with business clients</li><li>Estimate effort and timing necessary to deliver on requirements</li><li>Adjust to changes in those requirements as they occur</li><li>Provide thought leadership on design considerations and their tradeoffs</li></ul><p><strong>Project Execution</strong></p><ul><li>Assist in managing and coordinating the execution of projects in accordance with the client’s project strategy.</li><li>Provide planning/consulting support to operational teams and key internal and external constituents.</li><li>Assist in the development of strategic planning and analytics processes, services and operational management to ensure optimal execution of deliverables.</li></ul><p><strong>Qualifications</strong></p><ul><li>BS in Computer Science, CIS or a related field</li><li>C# is our primary coding language </li><li>At least 3-10+ years of experience in developing digital applications, preferably with exposure to diverse project teams that have included non-technical counterparts</li><li>General understanding of web development technologies, information architecture, and the web development process, including knowledge of limits and constraints of web design and site usability and security</li><li>Commitment to writing quality support documentation</li><li>Comfort working in both Agile and Waterfall philosophies</li><li>Prior experience with ADA compliance is a significant plus</li><li>SiteCore experience is ideal.  CMS experience is a plus</li><li>IIS administration experience is a plus</li></ul></p><p><strong>Apply:</strong> </p>"},{"title":"DriverReach: Senior Rails Developer","link":"http://authenticjobs.com/jobs/27338","pubDate":"Thu, 19 May 2016 14:47:16 CDT","description":"<p><strong>(Anywhere)</strong> <p>We’re a small group of passionate development geeks working on an up-and-coming software startup called DriverReach in the fast-growing trucking industry.</p><p>There are a lot of challenging issues and features for a talented Ruby on Rails developer to tackle. You’ll be working alongside the rest of the team and collaborating on feature development.</p><p>We’re a 100% remote team, that takes care to do good upfront design (specs and wireframes) before starting to code, and have a lot of fun working on the project.</p><p>You’ll be a good fit if you:</p><ul><li>Are self-disciplined and have a great work ethic</li><li>Have good time management skills</li><li>Communicate well</li><li>Love to learn new things and are willing to direction</li><li>Can work until 1pm EDT M - F</li></ul><p>Requirements:</p><ul><li>Ruby on Rails</li><li>JavaScript</li><li>jQuery</li><li>SQL</li><li>Git</li><li>MySQL</li><li>Unit tests</li><li>Memory profiling</li><li>Performance profiling</li><li>TDD</li><li>Background workers</li><li>Writing design docs</li><li>Wire-framing</li><li>Caching</li><li>API implementation</li></ul></p><p><strong>Job Perks:</strong> Work from home and only leave the house for fun!</p><p><strong>Apply:</strong> </p>"},{"title":"X-Team International: Javascript Developer","link":"http://authenticjobs.com/jobs/27322","pubDate":"Mon, 16 May 2016 19:37:40 CDT","description":"<p><strong>(Anywhere)</strong> <p>About X-Team</p><p>“Developers you can trust, whenever you need them.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are people who believe that #sleepcanwait when it comes to being there for others, that we all have the opportunity to unleash our inner superhero and effect change in the world.</p><p>About You</p><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p>Most important:</p><p>- Professional experience with Javascript</p><p>- Experience with JS-based frameworks (Node.js, Angular.js)</p><p>- Experience with testing frameworks (JSlint/JShint, Casper.js)</p><p>- Code optimization and performance improvements</p><p>- Write high-performance, reusable code for UI components</p><p>- Competent with revision control systems (Git)</p><p>Nice to have:</p><p>- Experience with working remotely</p><p>- Familiar/involved with open­ source projects</p><p>Personal:</p><p>- Independent</p><p>- Fluent in English, written and spoken</p><p>- Problem solver</p><p>- Proactive attitude</p><p>Benefits:</p><p>- Get the chance to work with big brands</p><p>- Work remotely, and live freely</p><p>- We’ll help you learn and grow each day</p><p>- Unleash your inner superhero</p></p><p><strong>Apply:</strong> </p>"},{"title":"X-Team International: PHP Developer (Symfony2)","link":"http://authenticjobs.com/jobs/27321","pubDate":"Mon, 16 May 2016 19:37:40 CDT","description":"<p><strong>(Anywhere)</strong> <p>About X-Team</p><p>“Developers you can trust, whenever you need them.”</p><p>X-Team is an international company founded in Melbourne, Australia that helps companies scale their development teams by providing them with extraordinary developers from around the world.</p><p>We are 100% remote and believe in building a world where developers can have access to an environment of growth and incredible opportunities regardless of where they live. Our culture is based around the proactive, selfless values that make up every X-Teamer.</p><p>We are people who believe that #sleepcanwait when it comes to being there for others, that we all have the opportunity to unleash our inner superhero and effect change in the world.</p><p>About You</p><p>The right individual will be self-driven. Someone who cares about maintainability of the code, automation, deployment processes and how to enable innovation through fostering a growing culture of Open Source. You will go beyond just coding and help to shape the engineering culture and best practices.</p><p>Most important:</p><p>- Professional experience with PHP 5 and MySQL</p><p>- MVC frameworks like Laravel or Symfony</p><p>- HTML, CSS, JavaScript and jQuery</p><p>- Ability to build and consume RESTful web services</p><p>- Competent with revision control systems (Git)</p><p>- Code optimization and performance improvements</p><p>- Knowledge common Design Patterns (SOLID)</p><p>- Passionate about writing beautiful and clean code</p><p>Nice to have:</p><p>- Experience with working remotely</p><p>- Familiar/involved with open­ source projects</p><p>Personal:</p><p>- Independent</p><p>- Fluent in English, written and spoken</p><p>- Problem solver</p><p>- Proactive attitude</p><p>Benefits:</p><p>- Get the chance to work with big brands</p><p>- Work remotely, and live freely</p><p>- We’ll help you learn and grow each day</p><p>- Unleash your inner superhero</p></p><p><strong>Apply:</strong> </p>"},{"title":"AMBR Detroit: Web & Mobile App Designer","link":"http://authenticjobs.com/jobs/27310","pubDate":"Fri, 13 May 2016 08:38:35 CDT","description":"<p><strong>(Detroit)</strong> <p>AMBR Detroit is searching for a full-time, on-site, website and mobile app designer in the Detroit area.</p><p>We are a 3 year-old web development company located in the heart of downtown Detroit. We use web standards to build awesome things such as mobile applications, custom software, and websites for a wide range of clients. </p><p>We’re looking for someone to join our team who is always up for a challenge, is self-motivated, and wants to help us build our evil empire and take over the world (muwhahaha). Just kidding on that last one….or are we?</p><p><strong>Are you up for a challenge?</strong></p><ul><li>Do you create stunning designs for web and mobile?</li><li>Can you solve problems through design?</li><li>Do you have a beautiful portfolio that reflects clean, and functional design?</li><li>Are you excited about the latest design trends, and have a desire to set new trends?</li></ul><p>Let’s create something awesome together!</p><p><strong>Requirements:</strong></p><ul><li>Ability to transform wireframes into design mock-ups for websites and web & mobile apps</li><li>Experience designing responsive websites</li><li>Experience with user interface design</li><li>Proficiency with Adobe Creative Suite</li><li>Strong understanding of current web design principals and user experience</li><li>1-3 years of experience</li></ul><p><strong>Bonus Skills:</strong></p><ul><li>Knowledge of HTML, CSS, and Javascript</li><li>Experience creating wireframes</li><li>Experience doing usability studies, and project discovery</li><li>Logo and brand creation</li></ul><p><br></p></p><p><strong>Job Perks:</strong> - Work in a fun office environment in downtown Detroit with fancy Herman Miller chairs, stand up desks, and free parking\n\n- Flexible schedule\n\n- Flexible vacation policy\n\n- Work from home, or from anywhere days\n\n- Performance based quarterly bonuses\n\n- Get paid to learn</p><p><strong>Apply:</strong> Sound Interesting?\n\nStart the conversation by sending your resume to careers@ambrdetroit.com. Please include a link to your online portfolio with examples of your work.​</p>"},{"title":"Situation Interactive: Senior Web Developer","link":"http://authenticjobs.com/jobs/27293","pubDate":"Tue, 10 May 2016 16:15:11 CDT","description":"<p><strong>(Nashville, TN)</strong> <p>OUR COMPANY:</p><p>Situation Interactive is an award-winning full service agency with a focus on immersive brand storytelling. We work with many of the world's leading arts and entertainment brands, including Major League Soccer, Wicked the Musical, Guggenheim, Brooklyn Academy of Music, USA Network and the NY/NJ Super Bowl Host Committee.</p><p>Situation has been named one of the Best Companies to Work for in New York by The New York State Society for Human Resource Management (NYS-SHRM). The 9th annual “Best Companies to Work for in New York” list is comprised of 80 companies with operations in the state.</p><p>You will love working here.</p><p>THE ROLE:</p><p>We are on a mission to have a fundamental impact on making live experiences more powerful and prevalent than ever in our society through meaningful ideas, technology and philanthropy.  We have the clients, the relationships and the experience – but, we now need two very special Developers to join us to reach our full potential.</p><p>While our agency is 70+ employees, our Web Development braintrust consists of a team of four Web Developers in partnership with a remarkable Project Management team.  Together, we believe:</p><ul><li>Shared values is critical to developing truly great work</li><li>Flexibility in work and place is a top priority</li><li>Treating your team with respect while leaving the ego at the door</li><li>Guts makes meaningful work that can make a difference</li></ul><p>By joining our team, you will be working in a highly collaborative environment no matter where you are located.  We maintain a policy and environment that welcomes work-from-anywhere but is ultimately powered by teams being highly collaborative with one another.</p><p>We currently looking for Web Developers to join our team. The position will be remotely located in Tennessee, in the Nashville Metropolitan area. This is a fast-paced, high profile development position focused on front-end web applications. As a member of our team, you will work collaboratively with a talented group of Designers, Developers, Strategists, Copywriters and Project Managers to create rich, interactive experiences that are on the cutting edge of web design.</p><p>THIS JOB IS PERFECT IF YOU:</p><ul><li>Have worked in an interactive agency environment before, and loved it.</li><li>Are an out-of-the-box thinker, able to come up with innovative solutions.</li><li>Are dedicated to staying at the forefront of emerging technologies. You never stop learning.</li><li>Are super collaborative, and enjoy being part of a team working together to make something awesome happen (a la The Avengers).</li><li>Can keep yourself independently motivated to stay the course on any given project, always finishing strong.</li><li>Thrive when challenged, and have no problem coming up with Plan B, Plan C, Plan D when Plan A doesn’t plan out.</li><li>Are obsessed with getting the details right every time.</li><li>Have a strong sense of design and a strong sense of humor.</li></ul><p>REQUIREMENTS (Know some of these, but not all? We encourage you to apply):</p><ul><li> (x)HTML, CSS, Javascript/jQuery, PHP, and SQL</li><li>Linux administration and programming via command line</li><li>Extensive experience with WordPress, familiarity with Laravel, CakePHP and/or Rails frameworks a plus</li><li>Git version control system and workflows</li><li>Working knowledge of Photoshop</li><li>Strong SEO and analytics proficiency</li><li>Standards-compliant front-end development techniques</li><li>Comfortable with complex and relational databases</li><li>Able to modify, expand, or refactor existing code contextually</li><li>Able to integrate with existing (Facebook, Twitter, YouTube, etc) and create custom RESTful APIs</li></ul><p>PERKS:</p><p>While we offer a competitive salary for the position, we also offer a range of perks for mind, body and spirit that have continued to put us among the best places to work.</p><p>Three we think you'll enjoy the most:</p><p>1. A comprehensive benefits package including 100% of your healthcare premium for full time employees (waiting periods apply)</p><p>2. Summer Fridays (half days) from Memorial Day through Labor Day</p><p>3. Paid time off policies that promote work life balance in mind, body and spirit</p><p>Situation is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p><p>APPLY. YES, THIS IS THE JOB FOR YOU.</p></p><p><strong>Apply:</strong> </p>"},{"title":"Particle: Senior Full-Stack Software Developer","link":"http://authenticjobs.com/jobs/27289","pubDate":"Tue, 10 May 2016 09:44:58 CDT","description":"<p><strong>(Anywhere, San Francisco, CA, Minneapolis, MN)</strong> <p>Particle is hiring experienced Full-Stack Engineers to build amazing tools for companies building \"Internet of Things\" (IoT) products. You'll be building easy-to-use developer tools, a reliable and secure platform, and services that will scale to support millions of connected devices and trillions of messages.</p><p>Particle is famous for the Particle Photon and Electron — Wi-Fi and cellular hardware development kits for creating Internet connected products. We've shipped more than 100,000 developer kits out to customers in more than 170 countries, and these developer kits are powered by our IoT platform, the Particle Cloud. What you may not know is that the Particle Cloud is also the back-end for hundreds of IoT products, from smart home appliances to heavy-duty industrial equipment. Particle is the most widely-used IoT platform out there, in particular because our tools are easy-to-use, open source, and affordable.</p><p>As a Full-Stack Engineer at Particle, you would work closely with a global team of talented and experienced engineers to make our platform more reliable, more secure, and more scalable. You would listen to customers in developer community and work to make our developer tools easier to use. You would build new features to help our customers ship their IoT products and build IoT businesses. You'll launch those features, collect customer feedback, and rework those features to make them even better.</p><p>You are likely to work on some of the following products:</p><p>- Particle Build, our Arduino-like web IDE for programming IoT devices over the air</p><p>- Particle Cloud, our secure, scalable, efficient IoT platform</p><p>- Particle Dashboard, our interface for managing devices, the data they generate, and the software that they're running</p><p>You are likely to work with some of the following languages, frameworks, and technologies:</p><p>- Node.js</p><p>- Express</p><p>- Ember</p><p>- React.js</p><p>- MongoDB</p><p>- ZeroMQ</p><p>- Redis</p><p>- Ruby on Rails</p><p>- Docker</p><p>We expect you to be creative, curious, and analytical. Particle is a fast-growing start-up in a young and evolving industry, so you should be self-driven and comfortable with uncertainty. You should love overcoming challenges and solving problems for customers.</p><h3>REQUIREMENTS</h3><ul><li>3-5+ years of professional software development experience; a computer science or computer engineering degree is a plus</li><li>Significant experience with JavaScript / Node.js, Express / Ember.js, ember-data, ember-cli</li><li>Experience with C/C++ and microcontroller development is a plus</li><li>Experience building IDEs or developer tools is a plus</li><li>Experience writing good tests (test-driven development is a plus)</li><li>Passion around developing interfaces and tools that are easy to use</li></ul><h3>WORKING AT PARTICLE</h3><ul><li>Competitive health, dental, and vision benefits</li><li>Stock options</li><li>Flexible and open vacation policy</li><li>Work from home and remote work supported and encouraged</li><li>Cell phone bill allowance</li><li>Commuter/telecommuter allowances</li><li>Generous parental leave policy</li><li>Work with an unbelievably talented and close-knit team</li></ul>About Particle<p>Particle is the most widely-used Internet of Things (IoT platform). We've built the largest community of developers and engineers in the industry, and we've shipped more than 100,000 development kits to 170 countries. Hundreds of IoT products, from smart home appliances to industrial equipment, are being built on Particle's platform. We are committed to making it easy for anyone to get their products online, and we support product creators of any size — from Fortune 500s to blossoming entrepreneurs.</p><p>We are inspired by our mission of enabling the next technological revolution, and by the incredible products that people build on our platform. We also support our Particle family and community by embracing our core values of caring, curiosity, openness, and joy.</p><p>Everyone is welcome at Particle. We are an equal opportunity employer who values diversity and inclusion and look for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p></p><p><strong>Job Perks:</strong> - Competitive health, dental, and vision benefits\n- Stock options\n- Flexible and open vacation policy\n- Work from home and remote work supported and encouraged\n- Cell phone bill allowance\n- Commuter/telecommuter allowances\n- Generous parental leave policy\n- Work with an unbelievably talented and close-knit team</p><p><strong>Apply:</strong> </p>"},{"title":"Particle: Front-end Software Developer","link":"http://authenticjobs.com/jobs/27288","pubDate":"Tue, 10 May 2016 09:44:58 CDT","description":"<p><strong>(Anywhere, San Francisco, CA, Minneapolis, MN)</strong> <p>Particle is hiring both junior and experienced front-end software developers to build amazing tools for companies building \"Internet of Things\" (IoT) products. You'll be building easy-to-use developer tools and interfaces that will scale to support thousands of customers, millions of connected devices and trillions of messages.</p><p>Particle is famous for the Particle Photon and Electron — Wi-Fi and cellular hardware development kits for creating Internet connected products. We've shipped more than 100,000 developer kits out to customers in more than 170 countries, and these developer kits are powered by our IoT platform, the Particle Cloud. What you may not know is that the Particle Cloud is also the back-end for hundreds of IoT products, from smart home appliances to heavy-duty industrial equipment. Particle is the most widely-used IoT platform out there, in particular because our tools are easy-to-use, open source, and affordable.</p><p>As a Front-end Software Developer at Particle, you would work closely with a global team of talented and experienced engineers to make easy-to-use developer tools and interfaces for communicating with and managing IoT devices and the data they generate. You would build new features to help our customers ship their IoT products and build IoT businesses. You'll launch those features, collect customer feedback from our customers and our developer community, and rework those features to make them even better.</p><p>You are likely to work on some of the following products:</p><p>- Particle Build, our Arduino-like web IDE for programming IoT devices over the air</p><p>- Particle Dashboard, our interface for managing devices, the data they generate, and the software that they're running</p><p>You are likely to work with some of the following languages, frameworks, and technologies:</p><p>- Ember</p><p>- React.js</p><p>- Node.js</p><p>- Express</p><p>- HTML/CSS</p><p>- Popular templating languages (Handlebars, SASS/Less, etc.)</p><p>You would also have opportunities to work on the back-end services and APIs that your front-end apps interact with.</p><p>We expect you to be creative, curious, and analytical. Particle is a fast-growing start-up in a young and evolving industry, so you should be self-driven and comfortable with uncertainty. You should love overcoming challenges and solving problems for customers.</p><h3>REQUIREMENTS</h3><ul><li>2+ years of professional front-end software development experience OR a degree in computer science, human computer interaction, or a related field</li><li>Significant experience with Javascript; experience with Ember, React.js, and other popular Javascript frameworks is a plus</li><li>Strong opinions and intuitions about user experience and aesthetics; you should have an eye for design</li><li>Experience building IDEs, developer tools, and other complex interfaces is a plus</li><li>Experience writing good tests (test-driven development is a plus)</li><li>Passion around developing interfaces and tools that are easy to use</li></ul><h3>WORKING AT PARTICLE</h3><ul><li>Competitive health, dental, and vision benefits</li><li>Stock options</li><li>Flexible and open vacation policy</li><li>Work from home and remote work supported and encouraged</li><li>Cell phone bill allowance</li><li>Commuter/telecommuter allowances</li><li>Generous parental leave policy</li><li>Work with an unbelievably talented and close-knit team</li></ul>About Particle<p>Particle is the most widely-used Internet of Things (IoT platform). We've built the largest community of developers and engineers in the industry, and we've shipped more than 100,000 development kits to 170 countries. Hundreds of IoT products, from smart home appliances to industrial equipment, are being built on Particle's platform. We are committed to making it easy for anyone to get their products online, and we support product creators of any size — from Fortune 500s to blossoming entrepreneurs.</p><p>We are inspired by our mission of enabling the next technological revolution, and by the incredible products that people build on our platform. We also support our Particle family and community by embracing our core values of caring, curiosity, openness, and joy.</p><p>Everyone is welcome at Particle. We are an equal opportunity employer who values diversity and inclusion and look for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p></p><p><strong>Job Perks:</strong> - Competitive health, dental, and vision benefits\n- Stock options\n- Flexible and open vacation policy\n- Work from home and remote work supported and encouraged\n- Cell phone bill allowance\n- Commuter/telecommuter allowances\n- Generous parental leave policy\n- Work with an unbelievably talented and close-knit team</p><p><strong>Apply:</strong> </p>"},{"title":"O'Reilly Media, Inc.: Software Engineer, Python","link":"http://authenticjobs.com/jobs/27281","pubDate":"Mon, 09 May 2016 13:21:59 CDT","description":"<p><strong>(Anywhere in North America)</strong> <p><strong>About O'Reilly Media:</strong></p>  <p> O’Reilly’s mission is “changing the world by sharing the knowledge of innovators.” For over 30 years, we’ve been helping people learn new skills, track significant new technologies, and build careers in technology and business. This extends to our employees: we have a long and proud history of encouraging and enabling the people who work here to take advantage of O’Reilly’s resources and network to keep learning, take on new challenges, and build careers. </p><p>O’Reilly Media is looking for a Django software developer who cares about building tools and applications that help train people to be better at what they do. Our membership service is used around the world to help professionals and<del>,</del> technologists<strong> </strong>hone their craft, learn new skills, and share their knowledge. </p><p><strong>You:</strong></p><ul><li>will work with a distributed, full-stack team focused on honing our edge as a premier training platform by integrating new and innovative teaching models, developing more personalized learning experience, and continuing to build support for a diversity of content. </li><li>will help the best and brightest engineers, designers, and product managers to find the articles, books, videos, and tutorials that will inspire and educate them. </li><li>will enjoy the pleasure of working with a set of colleagues that believe deeply in the lifelong importance of education and learning.</li></ul><p><strong>Skills & Requirements</strong></p><p>Our development stack is Python/Django, Celery, Git, Postgres, and django-rest-framework.  Search and content discovery on our site is powered by a separate service built on Solr.  Our front-end is built on Backbone.js, and many<del> </del>services are delivered<del> </del>as Docker containers.   </p><p>We have a dedication to testing (Tox), sensible style (PEP8), and insightful and respectful code review. </p><p>We are hoping for a Four-year      college degree in Computer Science or related field, or combination of      relevant education and work experience.</p><p>We are looking for at least 2+ years experience in software application      development in web-based systems and multi-tier environments.</p><p>We look to applicants who are familiar with multiple aspects of this stack, but are also happy to introduce you to these technologies as part of your work.  We collaborate nimbly in small teams that include product managers, IT, and QA, and we have a core belief in work-life balance. The men and women of our technology team welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of tech keywords.<br></p><p><br></p></p><p><strong>Apply:</strong> Please send us your cover letter and resume.</p>"},{"title":"O'Reilly Media, Inc.: Senior Mobile Product Designer","link":"http://authenticjobs.com/jobs/27279","pubDate":"Mon, 09 May 2016 13:21:59 CDT","description":"<p><strong>(Anywhere in North America)</strong> <p><strong>About O'Reilly Media</strong></p>  <p> O’Reilly’s mission is “changing the world by sharing the knowledge of innovators.” For over 30 years, we’ve been helping people learn new skills, track significant new technologies, and build careers in technology and business. This extends to our employees: we have a long and proud history of encouraging and enabling the people who work here to take advantage of O’Reilly’s resources and network to keep learning, take on new challenges, and build careers. </p>  <p><strong>About the team </strong></p>  <p>Safari is O’Reilly’s training and reference platform, with a library of tens of thousands of books and videos at its core, enhanced by a number of different learning products. We have a large audience of technical and business users, both individuals and in large corporations, who rely on our content to support their professional development. Our mobile apps are an increasingly important part of what we do, and we’ve been investing heavily in our team.</p>  <p>O’Reilly Media is looking for a <strong>Senior </strong><strong>Mobile Product Designer</strong> for our Safari Android and iOS apps. You will have responsibilities in both interface and user experience design, collaborating closely with the product manager and a tight-knit development team.<br> <br> The kinds of things you’ll be working on:</p>  <ul>  <li>Innovative      methods of delivering structured training, bringing together different      kinds of content in new and compelling ways</li>  <li>Interfaces      that encourage users to browse and discover content in our large library</li>  <li>Features      that help users reflect on and derive satisfaction from their learning      progress</li>  <li>Ongoing      improvements to our reader and video player UIs</li>  <li>Materials      for marketing our apps, both internally and externally</li>  <li>Collaborative      projects with our web UX team to make sure that new features are delivered      consistently across platforms</li>  <li>Prototypes      and proofs-of-concept for new features – and perhaps whole new apps</li> </ul>  <p><strong>You</strong></p>  <ul>  <li>Care      deeply about every aspect of a user’s experience, even the boring parts.</li>  <li>Have      strong product instincts – you should love listening to our end users and      understanding what motivates them, and you should be confident translating      what they ask for into what they need.</li>  <li>Are      well versed in the iOS HIG and Android’s Material Design guidelines, yet      unafraid to go a different route when needed.</li>  <li>Are      professional and timely: you are able to deliver device-appropriate      designs and prototypes, in formats that make our engineers’ lives easy and      leave no room for doubt.</li>  <li>Are      reliable and communicative. Whether in the office or working remotely, we      need you to feel connected and be actively contributing to the team, not      working in isolation.</li>  <li>Can      point to at least one publicly available Android and iOS app that you’ve      had your paws all over, and can talk in detail about your involvement and      the decisions you made.</li> </ul>  <p>Here are some things that we currently use and find helpful – if you’re already experienced with these, then you’ll get up to speed much more quickly:</p>  <ul>  <li>Sketch,      InVision, and Zeplin</li>  <li>Principle,      Origami, and After Effects for producing interaction prototypes</li>  <li>Screen      capture and editing software such as ScreenFlow, for producing screencasts      and other marketing / support content</li>  <li>Agile      processes and tools, like Jira and Trello</li>  <li>Git,      XCode, and Android Studio to deploy new versions of our apps on your      devices, for testing and review</li></ul></p><p><strong>Apply:</strong> Please send us your cover letter and resume.</p>"},{"title":"OpenTable: Web UI Engineer","link":"http://authenticjobs.com/jobs/27282","pubDate":"Mon, 09 May 2016 13:21:31 CDT","description":"<p><strong>(San Francisco)</strong> <h1>Web UI Engineer</h1><p>At OpenTable we love the web and what it can do for restaurants. We build dream software for restaurants. Our cloud restaurant operations solution is what drives reservation availability on OpenTable.com and helps our restaurants deliver phenomenal hospitality.</p><h2>Desired Experience:</h2><h3>Required</h3><ul><li>Strong skills in client side debugging</li><li>Very strong skills in HTML and CSS</li><li>Strong skills in DOM scripting</li><li>Intermediate skills in JavaScript (CoffeeScript a plus)</li><li>Experience in cross browser open web platform UI development</li><li>Experience with client side MV* frameworks (especially Angular)</li><li>Some experience with CSS pre or post processing (especially Sass)</li><li>2-3 years working on thick/fat client web applications (B2B a plus)</li></ul><h3>Nice To Have</h3><ul><li>Experience with Agile, iterative refactoring, and peer code reviews</li><li>Experience using version control (git and gitflow a plus)</li><li>Experience with automated unit and end-to-end testing and continuous integration and/or deployments</li><li>Experience contributing to UI libraries or frameworks (experimentation with web components a plus)</li><li>Strong knowledge of CSS architecture such as OOCSS/BEM/SMACSS/SUIT (OOCSS and BEM a plus)</li><li>Knowledge of loosely coupled component architecture and of software design patterns</li><li>Experience implementing 'mobile first' sites and/or mobile web applications or knowledge of responsive and adaptive techniques</li><li>Knowledge of visual testing frameworks (PDiff, Huxley, PhantomCSS, Wraith, Hardy)</li><li>Knowledge of front end performance tooling, especially regarding browser rendering</li><li>Previous experience with technology in our stack and environment: Linux/Mac, Docker, Node.JS, Grunt/Gulp, Coffee-Script, C#</li></ul><h2>Why work for OpenTable?</h2><h3>We love the web and what it can do for restaurants</h3><p>We build dream software for restaurants. Our cloud restaurant operations solution is what drives reservation availability on OpenTable.com and helps our restaurants deliver phenomenal hospitality. As people who love a good dining experience ourselves, we care about how restaurants serve delicious meals to their guests.</p><p>We don't just work, we also play. We have a monthly Waffle Wednesday tradition that keeps getting yummier. Departments take turns planning themed company-wide happy hours with food and drinks. FIFA World Cup was an international company event; we were glued to the TV for the games. OpenTable is hardcore about Halloween—join us for our annual costume contest, department decorations, and celebration!</p><p>But don't join us for the food and fun, join us for the engineering...</p><h3>We are an engineering driven organization</h3><p>We're a tech company first and foremost, backed by very sharp product teams that have a thorough understanding of the restaurant industry.</p><p>The best product ideas are nothing if they can't be executed properly at high scale, and upper management knows that. Engineers drive innovation, and constantly advance the status quo. Each team member can have a meaningful impact on the product and a vital role in shaping OpenTable's future.</p><h3>What you will be working on</h3><p>You will be part of a growing team of web developers and designers who build web applications which are taking restaurant hospitality and dining experiences to the next level worldwide. Want to book restaurant reservations in Japan for your trip next month from Portland, Oregon? At OpenTable, you will be an integral part of creating an international product anyone can access from anywhere in any language on any device.</p><p>We're using the latest and greatest in web technologies. Heard of web components? We are already working on next-generation implementations internally so we are ready to roll out when the time is right. And we're not just creating products, we're building a platform. At OpenTable you'll establish infrastructure, implement, and distribute modular solutions for web GUIs.  </p><p>Our roadmap is packed with innovations we can't wait to get into the hands of restaurants. You can make a difference helping us transform how restaurants operate their businesses all around the world.</p><h2>About you</h2><p>You are a driven and dedicated UI engineer, with an appetite for knowledge and a deep understanding of web technologies, including the latest standards and techniques. You excel at writing highly performant UIs with JavaScript, HTML, and CSS that are easy to scale and work across different browsers and devices.</p><p>You aim for perfection, but put pragmatism first. You're a quick learner with well-developed analytical and problem solving skills. You consider maintainability key at enterprise scale and value the more robust solution.</p><ul><li>You have experience in collaborating on web GUIs—you're a master at evolving interaction design with a design partner to make user experiences more productive.</li><li>You love to teach as much as you like to learn. You'll be able to leverage your deep experience and expertise and help others on the team to benefit.</li><li>You can rapidly prototype new designs internally, working with product partners and with customers to create UIs that exceed expectations through thoughtful design.</li><li>You enjoy the process of selling your ideas to your peers, design partners, product partners, and the public at large through evangelism ranging from small meetings to speaking at conferences.</li><li>You consider other developers a user group, and strive to provide simple programmatic interfaces to your coworkers in the code you write to implement graphical interfaces for your customers.</li><li>You're able to break the interface design for a product feature down into useful technical abstractions based on visual, behavioral, and other patterns.</li></ul><h2>How we work</h2><p>We're an agile group that is partitioned into teams tasked around either feature verticals or platform horizontals. While our feature teams benefit from owning their products and deliverables independent of each other, our platform teams take on the mission of unifying our entire product suite through technology and best practices. We believe in not building the same thing multiple times and in providing tools and services to our teammates that let them focus on building the features restaurants need.</p><p>While building UI components is an integral part of our mission, how we build and deliver is just as important to us as the end product. We pride ourselves in owning and defining our own development and delivery flow to make our results better. Our team iterates on our process as much as we do our products. We depend 